mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
/*******************************************************************************
 *  Copyright(C)2018 by Dreistein<mcu_shilei@hotmail.com>                     *
 *                                                                            *
 *  This program is free software; you can redistribute it and/or modify it   *
 *  under the terms of the GNU Lesser General Public License as published     *
 *  by the Free Software Foundation; either version 3 of the License, or      *
 *  (at your option) any later version.                                       *
 *                                                                            *
 *  This program is distributed in the hope that it will be useful, but       *
 *  WITHOUT ANY WARRANTY; without even the implied warranty of                *
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU          *
 *  General Public License for more details.                                  *
 *                                                                            *
 *  You should have received a copy of the GNU Lesser General Public License  *
 *  along with this program; if not, see http://www.gnu.org/licenses/.        *
*******************************************************************************/

//! Do not move this pre-processor statement to other places
#ifndef __DRIVER_ARM_M4_AMBIQ_APOLLO2_REG_GPIO_H__
#define __DRIVER_ARM_M4_AMBIQ_APOLLO2_REG_GPIO_H__

/*============================ INCLUDES ======================================*/
/*============================ MACROS ========================================*/
#define REG_GPIO               (*(gpio_reg_t *)   REG_GPIO_BASEADDR)


//*****************************************************************************
//
// Key values.
//
//*****************************************************************************
#define REG_GPIO_PADKEY_KEYVAL                    0x00000073

//*****************************************************************************
//
// GPIO_INT0EN - GPIO Interrupt Registers 31-0: Enable
//
//*****************************************************************************
// GPIO31 interrupt.
#define REG_GPIO_INT0EN_GPIO31_S                  31
#define REG_GPIO_INT0EN_GPIO31_M                  0x80000000
#define REG_GPIO_INT0EN_GPIO31(n)                 (((uint32_t)(n) << 31) & 0x80000000)

// GPIO30 interrupt.
#define REG_GPIO_INT0EN_GPIO30_S                  30
#define REG_GPIO_INT0EN_GPIO30_M                  0x40000000
#define REG_GPIO_INT0EN_GPIO30(n)                 (((uint32_t)(n) << 30) & 0x40000000)

// GPIO29 interrupt.
#define REG_GPIO_INT0EN_GPIO29_S                  29
#define REG_GPIO_INT0EN_GPIO29_M                  0x20000000
#define REG_GPIO_INT0EN_GPIO29(n)                 (((uint32_t)(n) << 29) & 0x20000000)

// GPIO28 interrupt.
#define REG_GPIO_INT0EN_GPIO28_S                  28
#define REG_GPIO_INT0EN_GPIO28_M                  0x10000000
#define REG_GPIO_INT0EN_GPIO28(n)                 (((uint32_t)(n) << 28) & 0x10000000)

// GPIO27 interrupt.
#define REG_GPIO_INT0EN_GPIO27_S                  27
#define REG_GPIO_INT0EN_GPIO27_M                  0x08000000
#define REG_GPIO_INT0EN_GPIO27(n)                 (((uint32_t)(n) << 27) & 0x08000000)

// GPIO26 interrupt.
#define REG_GPIO_INT0EN_GPIO26_S                  26
#define REG_GPIO_INT0EN_GPIO26_M                  0x04000000
#define REG_GPIO_INT0EN_GPIO26(n)                 (((uint32_t)(n) << 26) & 0x04000000)

// GPIO25 interrupt.
#define REG_GPIO_INT0EN_GPIO25_S                  25
#define REG_GPIO_INT0EN_GPIO25_M                  0x02000000
#define REG_GPIO_INT0EN_GPIO25(n)                 (((uint32_t)(n) << 25) & 0x02000000)

// GPIO24 interrupt.
#define REG_GPIO_INT0EN_GPIO24_S                  24
#define REG_GPIO_INT0EN_GPIO24_M                  0x01000000
#define REG_GPIO_INT0EN_GPIO24(n)                 (((uint32_t)(n) << 24) & 0x01000000)

// GPIO23 interrupt.
#define REG_GPIO_INT0EN_GPIO23_S                  23
#define REG_GPIO_INT0EN_GPIO23_M                  0x00800000
#define REG_GPIO_INT0EN_GPIO23(n)                 (((uint32_t)(n) << 23) & 0x00800000)

// GPIO22 interrupt.
#define REG_GPIO_INT0EN_GPIO22_S                  22
#define REG_GPIO_INT0EN_GPIO22_M                  0x00400000
#define REG_GPIO_INT0EN_GPIO22(n)                 (((uint32_t)(n) << 22) & 0x00400000)

// GPIO21 interrupt.
#define REG_GPIO_INT0EN_GPIO21_S                  21
#define REG_GPIO_INT0EN_GPIO21_M                  0x00200000
#define REG_GPIO_INT0EN_GPIO21(n)                 (((uint32_t)(n) << 21) & 0x00200000)

// GPIO20 interrupt.
#define REG_GPIO_INT0EN_GPIO20_S                  20
#define REG_GPIO_INT0EN_GPIO20_M                  0x00100000
#define REG_GPIO_INT0EN_GPIO20(n)                 (((uint32_t)(n) << 20) & 0x00100000)

// GPIO19 interrupt.
#define REG_GPIO_INT0EN_GPIO19_S                  19
#define REG_GPIO_INT0EN_GPIO19_M                  0x00080000
#define REG_GPIO_INT0EN_GPIO19(n)                 (((uint32_t)(n) << 19) & 0x00080000)

// GPIO18interrupt.
#define REG_GPIO_INT0EN_GPIO18_S                  18
#define REG_GPIO_INT0EN_GPIO18_M                  0x00040000
#define REG_GPIO_INT0EN_GPIO18(n)                 (((uint32_t)(n) << 18) & 0x00040000)

// GPIO17 interrupt.
#define REG_GPIO_INT0EN_GPIO17_S                  17
#define REG_GPIO_INT0EN_GPIO17_M                  0x00020000
#define REG_GPIO_INT0EN_GPIO17(n)                 (((uint32_t)(n) << 17) & 0x00020000)

// GPIO16 interrupt.
#define REG_GPIO_INT0EN_GPIO16_S                  16
#define REG_GPIO_INT0EN_GPIO16_M                  0x00010000
#define REG_GPIO_INT0EN_GPIO16(n)                 (((uint32_t)(n) << 16) & 0x00010000)

// GPIO15 interrupt.
#define REG_GPIO_INT0EN_GPIO15_S                  15
#define REG_GPIO_INT0EN_GPIO15_M                  0x00008000
#define REG_GPIO_INT0EN_GPIO15(n)                 (((uint32_t)(n) << 15) & 0x00008000)

// GPIO14 interrupt.
#define REG_GPIO_INT0EN_GPIO14_S                  14
#define REG_GPIO_INT0EN_GPIO14_M                  0x00004000
#define REG_GPIO_INT0EN_GPIO14(n)                 (((uint32_t)(n) << 14) & 0x00004000)

