mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO13 interrupt.
#define REG_GPIO_INT0EN_GPIO13_S                  13
#define REG_GPIO_INT0EN_GPIO13_M                  0x00002000
#define REG_GPIO_INT0EN_GPIO13(n)                 (((uint32_t)(n) << 13) & 0x00002000)

// GPIO12 interrupt.
#define REG_GPIO_INT0EN_GPIO12_S                  12
#define REG_GPIO_INT0EN_GPIO12_M                  0x00001000
#define REG_GPIO_INT0EN_GPIO12(n)                 (((uint32_t)(n) << 12) & 0x00001000)

// GPIO11 interrupt.
#define REG_GPIO_INT0EN_GPIO11_S                  11
#define REG_GPIO_INT0EN_GPIO11_M                  0x00000800
#define REG_GPIO_INT0EN_GPIO11(n)                 (((uint32_t)(n) << 11) & 0x00000800)

// GPIO10 interrupt.
#define REG_GPIO_INT0EN_GPIO10_S                  10
#define REG_GPIO_INT0EN_GPIO10_M                  0x00000400
#define REG_GPIO_INT0EN_GPIO10(n)                 (((uint32_t)(n) << 10) & 0x00000400)

// GPIO9 interrupt.
#define REG_GPIO_INT0EN_GPIO9_S                   9
#define REG_GPIO_INT0EN_GPIO9_M                   0x00000200
#define REG_GPIO_INT0EN_GPIO9(n)                  (((uint32_t)(n) << 9) & 0x00000200)

// GPIO8 interrupt.
#define REG_GPIO_INT0EN_GPIO8_S                   8
#define REG_GPIO_INT0EN_GPIO8_M                   0x00000100
#define REG_GPIO_INT0EN_GPIO8(n)                  (((uint32_t)(n) << 8) & 0x00000100)

// GPIO7 interrupt.
#define REG_GPIO_INT0EN_GPIO7_S                   7
#define REG_GPIO_INT0EN_GPIO7_M                   0x00000080
#define REG_GPIO_INT0EN_GPIO7(n)                  (((uint32_t)(n) << 7) & 0x00000080)

// GPIO6 interrupt.
#define REG_GPIO_INT0EN_GPIO6_S                   6
#define REG_GPIO_INT0EN_GPIO6_M                   0x00000040
#define REG_GPIO_INT0EN_GPIO6(n)                  (((uint32_t)(n) << 6) & 0x00000040)

// GPIO5 interrupt.
#define REG_GPIO_INT0EN_GPIO5_S                   5
#define REG_GPIO_INT0EN_GPIO5_M                   0x00000020
#define REG_GPIO_INT0EN_GPIO5(n)                  (((uint32_t)(n) << 5) & 0x00000020)

// GPIO4 interrupt.
#define REG_GPIO_INT0EN_GPIO4_S                   4
#define REG_GPIO_INT0EN_GPIO4_M                   0x00000010
#define REG_GPIO_INT0EN_GPIO4(n)                  (((uint32_t)(n) << 4) & 0x00000010)

// GPIO3 interrupt.
#define REG_GPIO_INT0EN_GPIO3_S                   3
#define REG_GPIO_INT0EN_GPIO3_M                   0x00000008
#define REG_GPIO_INT0EN_GPIO3(n)                  (((uint32_t)(n) << 3) & 0x00000008)

// GPIO2 interrupt.
#define REG_GPIO_INT0EN_GPIO2_S                   2
#define REG_GPIO_INT0EN_GPIO2_M                   0x00000004
#define REG_GPIO_INT0EN_GPIO2(n)                  (((uint32_t)(n) << 2) & 0x00000004)

// GPIO1 interrupt.
#define REG_GPIO_INT0EN_GPIO1_S                   1
#define REG_GPIO_INT0EN_GPIO1_M                   0x00000002
#define REG_GPIO_INT0EN_GPIO1(n)                  (((uint32_t)(n) << 1) & 0x00000002)

// GPIO0 interrupt.
#define REG_GPIO_INT0EN_GPIO0_S                   0
#define REG_GPIO_INT0EN_GPIO0_M                   0x00000001
#define REG_GPIO_INT0EN_GPIO0(n)                  (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_INT0STAT - GPIO Interrupt Registers 31-0: Status
//
//*****************************************************************************
// GPIO31 interrupt.
#define REG_GPIO_INT0STAT_GPIO31_S                31
#define REG_GPIO_INT0STAT_GPIO31_M                0x80000000
#define REG_GPIO_INT0STAT_GPIO31(n)               (((uint32_t)(n) << 31) & 0x80000000)

// GPIO30 interrupt.
#define REG_GPIO_INT0STAT_GPIO30_S                30
#define REG_GPIO_INT0STAT_GPIO30_M                0x40000000
#define REG_GPIO_INT0STAT_GPIO30(n)               (((uint32_t)(n) << 30) & 0x40000000)

// GPIO29 interrupt.
#define REG_GPIO_INT0STAT_GPIO29_S                29
#define REG_GPIO_INT0STAT_GPIO29_M                0x20000000
#define REG_GPIO_INT0STAT_GPIO29(n)               (((uint32_t)(n) << 29) & 0x20000000)

// GPIO28 interrupt.
#define REG_GPIO_INT0STAT_GPIO28_S                28
#define REG_GPIO_INT0STAT_GPIO28_M                0x10000000
#define REG_GPIO_INT0STAT_GPIO28(n)               (((uint32_t)(n) << 28) & 0x10000000)

// GPIO27 interrupt.
#define REG_GPIO_INT0STAT_GPIO27_S                27
#define REG_GPIO_INT0STAT_GPIO27_M                0x08000000
#define REG_GPIO_INT0STAT_GPIO27(n)               (((uint32_t)(n) << 27) & 0x08000000)

// GPIO26 interrupt.
#define REG_GPIO_INT0STAT_GPIO26_S                26
#define REG_GPIO_INT0STAT_GPIO26_M                0x04000000
#define REG_GPIO_INT0STAT_GPIO26(n)               (((uint32_t)(n) << 26) & 0x04000000)

// GPIO25 interrupt.
#define REG_GPIO_INT0STAT_GPIO25_S                25
#define REG_GPIO_INT0STAT_GPIO25_M                0x02000000
#define REG_GPIO_INT0STAT_GPIO25(n)               (((uint32_t)(n) << 25) & 0x02000000)

// GPIO24 interrupt.
#define REG_GPIO_INT0STAT_GPIO24_S                24
#define REG_GPIO_INT0STAT_GPIO24_M                0x01000000
#define REG_GPIO_INT0STAT_GPIO24(n)               (((uint32_t)(n) << 24) & 0x01000000)

// GPIO23 interrupt.
#define REG_GPIO_INT0STAT_GPIO23_S                23
#define REG_GPIO_INT0STAT_GPIO23_M                0x00800000
#define REG_GPIO_INT0STAT_GPIO23(n)               (((uint32_t)(n) << 23) & 0x00800000)

// GPIO22 interrupt.
#define REG_GPIO_INT0STAT_GPIO22_S                22
#define REG_GPIO_INT0STAT_GPIO22_M                0x00400000
#define REG_GPIO_INT0STAT_GPIO22(n)               (((uint32_t)(n) << 22) & 0x00400000)

// GPIO21 interrupt.
#define REG_GPIO_INT0STAT_GPIO21_S                21
#define REG_GPIO_INT0STAT_GPIO21_M                0x00200000
#define REG_GPIO_INT0STAT_GPIO21(n)               (((uint32_t)(n) << 21) & 0x00200000)

// GPIO20 interrupt.
#define REG_GPIO_INT0STAT_GPIO20_S                20
#define REG_GPIO_INT0STAT_GPIO20_M                0x00100000
#define REG_GPIO_INT0STAT_GPIO20(n)               (((uint32_t)(n) << 20) & 0x00100000)

// GPIO19 interrupt.
#define REG_GPIO_INT0STAT_GPIO19_S                19
#define REG_GPIO_INT0STAT_GPIO19_M                0x00080000
#define REG_GPIO_INT0STAT_GPIO19(n)               (((uint32_t)(n) << 19) & 0x00080000)

// GPIO18interrupt.
#define REG_GPIO_INT0STAT_GPIO18_S                18
#define REG_GPIO_INT0STAT_GPIO18_M                0x00040000
#define REG_GPIO_INT0STAT_GPIO18(n)               (((uint32_t)(n) << 18) & 0x00040000)

// GPIO17 interrupt.
#define REG_GPIO_INT0STAT_GPIO17_S                17
#define REG_GPIO_INT0STAT_GPIO17_M                0x00020000
#define REG_GPIO_INT0STAT_GPIO17(n)               (((uint32_t)(n) << 17) & 0x00020000)

