mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO37 interrupt.
#define REG_GPIO_INT1EN_GPIO37_S                  5
#define REG_GPIO_INT1EN_GPIO37_M                  0x00000020
#define REG_GPIO_INT1EN_GPIO37(n)                 (((uint32_t)(n) << 5) & 0x00000020)

// GPIO36 interrupt.
#define REG_GPIO_INT1EN_GPIO36_S                  4
#define REG_GPIO_INT1EN_GPIO36_M                  0x00000010
#define REG_GPIO_INT1EN_GPIO36(n)                 (((uint32_t)(n) << 4) & 0x00000010)

// GPIO35 interrupt.
#define REG_GPIO_INT1EN_GPIO35_S                  3
#define REG_GPIO_INT1EN_GPIO35_M                  0x00000008
#define REG_GPIO_INT1EN_GPIO35(n)                 (((uint32_t)(n) << 3) & 0x00000008)

// GPIO34 interrupt.
#define REG_GPIO_INT1EN_GPIO34_S                  2
#define REG_GPIO_INT1EN_GPIO34_M                  0x00000004
#define REG_GPIO_INT1EN_GPIO34(n)                 (((uint32_t)(n) << 2) & 0x00000004)

// GPIO33 interrupt.
#define REG_GPIO_INT1EN_GPIO33_S                  1
#define REG_GPIO_INT1EN_GPIO33_M                  0x00000002
#define REG_GPIO_INT1EN_GPIO33(n)                 (((uint32_t)(n) << 1) & 0x00000002)

// GPIO32 interrupt.
#define REG_GPIO_INT1EN_GPIO32_S                  0
#define REG_GPIO_INT1EN_GPIO32_M                  0x00000001
#define REG_GPIO_INT1EN_GPIO32(n)                 (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_INT1STAT - GPIO Interrupt Registers 49-32: Status
//
//*****************************************************************************
// GPIO49 interrupt.
#define REG_GPIO_INT1STAT_GPIO49_S                17
#define REG_GPIO_INT1STAT_GPIO49_M                0x00020000
#define REG_GPIO_INT1STAT_GPIO49(n)               (((uint32_t)(n) << 17) & 0x00020000)

// GPIO48 interrupt.
#define REG_GPIO_INT1STAT_GPIO48_S                16
#define REG_GPIO_INT1STAT_GPIO48_M                0x00010000
#define REG_GPIO_INT1STAT_GPIO48(n)               (((uint32_t)(n) << 16) & 0x00010000)

// GPIO47 interrupt.
#define REG_GPIO_INT1STAT_GPIO47_S                15
#define REG_GPIO_INT1STAT_GPIO47_M                0x00008000
#define REG_GPIO_INT1STAT_GPIO47(n)               (((uint32_t)(n) << 15) & 0x00008000)

// GPIO46 interrupt.
#define REG_GPIO_INT1STAT_GPIO46_S                14
#define REG_GPIO_INT1STAT_GPIO46_M                0x00004000
#define REG_GPIO_INT1STAT_GPIO46(n)               (((uint32_t)(n) << 14) & 0x00004000)

// GPIO45 interrupt.
#define REG_GPIO_INT1STAT_GPIO45_S                13
#define REG_GPIO_INT1STAT_GPIO45_M                0x00002000
#define REG_GPIO_INT1STAT_GPIO45(n)               (((uint32_t)(n) << 13) & 0x00002000)

// GPIO44 interrupt.
#define REG_GPIO_INT1STAT_GPIO44_S                12
#define REG_GPIO_INT1STAT_GPIO44_M                0x00001000
#define REG_GPIO_INT1STAT_GPIO44(n)               (((uint32_t)(n) << 12) & 0x00001000)

// GPIO43 interrupt.
#define REG_GPIO_INT1STAT_GPIO43_S                11
#define REG_GPIO_INT1STAT_GPIO43_M                0x00000800
#define REG_GPIO_INT1STAT_GPIO43(n)               (((uint32_t)(n) << 11) & 0x00000800)

// GPIO42 interrupt.
#define REG_GPIO_INT1STAT_GPIO42_S                10
#define REG_GPIO_INT1STAT_GPIO42_M                0x00000400
#define REG_GPIO_INT1STAT_GPIO42(n)               (((uint32_t)(n) << 10) & 0x00000400)

// GPIO41 interrupt.
#define REG_GPIO_INT1STAT_GPIO41_S                9
#define REG_GPIO_INT1STAT_GPIO41_M                0x00000200
#define REG_GPIO_INT1STAT_GPIO41(n)               (((uint32_t)(n) << 9) & 0x00000200)

// GPIO40 interrupt.
#define REG_GPIO_INT1STAT_GPIO40_S                8
#define REG_GPIO_INT1STAT_GPIO40_M                0x00000100
#define REG_GPIO_INT1STAT_GPIO40(n)               (((uint32_t)(n) << 8) & 0x00000100)

// GPIO39 interrupt.
#define REG_GPIO_INT1STAT_GPIO39_S                7
#define REG_GPIO_INT1STAT_GPIO39_M                0x00000080
#define REG_GPIO_INT1STAT_GPIO39(n)               (((uint32_t)(n) << 7) & 0x00000080)

// GPIO38 interrupt.
#define REG_GPIO_INT1STAT_GPIO38_S                6
#define REG_GPIO_INT1STAT_GPIO38_M                0x00000040
#define REG_GPIO_INT1STAT_GPIO38(n)               (((uint32_t)(n) << 6) & 0x00000040)

// GPIO37 interrupt.
#define REG_GPIO_INT1STAT_GPIO37_S                5
#define REG_GPIO_INT1STAT_GPIO37_M                0x00000020
#define REG_GPIO_INT1STAT_GPIO37(n)               (((uint32_t)(n) << 5) & 0x00000020)

// GPIO36 interrupt.
#define REG_GPIO_INT1STAT_GPIO36_S                4
#define REG_GPIO_INT1STAT_GPIO36_M                0x00000010
#define REG_GPIO_INT1STAT_GPIO36(n)               (((uint32_t)(n) << 4) & 0x00000010)

// GPIO35 interrupt.
#define REG_GPIO_INT1STAT_GPIO35_S                3
#define REG_GPIO_INT1STAT_GPIO35_M                0x00000008
#define REG_GPIO_INT1STAT_GPIO35(n)               (((uint32_t)(n) << 3) & 0x00000008)

// GPIO34 interrupt.
#define REG_GPIO_INT1STAT_GPIO34_S                2
#define REG_GPIO_INT1STAT_GPIO34_M                0x00000004
#define REG_GPIO_INT1STAT_GPIO34(n)               (((uint32_t)(n) << 2) & 0x00000004)

// GPIO33 interrupt.
#define REG_GPIO_INT1STAT_GPIO33_S                1
#define REG_GPIO_INT1STAT_GPIO33_M                0x00000002
#define REG_GPIO_INT1STAT_GPIO33(n)               (((uint32_t)(n) << 1) & 0x00000002)

// GPIO32 interrupt.
#define REG_GPIO_INT1STAT_GPIO32_S                0
#define REG_GPIO_INT1STAT_GPIO32_M                0x00000001
#define REG_GPIO_INT1STAT_GPIO32(n)               (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_INT1CLR - GPIO Interrupt Registers 49-32: Clear
//
//*****************************************************************************
// GPIO49 interrupt.
#define REG_GPIO_INT1CLR_GPIO49_S                 17
#define REG_GPIO_INT1CLR_GPIO49_M                 0x00020000
#define REG_GPIO_INT1CLR_GPIO49(n)                (((uint32_t)(n) << 17) & 0x00020000)

// GPIO48 interrupt.
#define REG_GPIO_INT1CLR_GPIO48_S                 16
#define REG_GPIO_INT1CLR_GPIO48_M                 0x00010000
#define REG_GPIO_INT1CLR_GPIO48(n)                (((uint32_t)(n) << 16) & 0x00010000)

