mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO37 interrupt.
#define REG_GPIO_INT1SET_GPIO37_S                 5
#define REG_GPIO_INT1SET_GPIO37_M                 0x00000020
#define REG_GPIO_INT1SET_GPIO37(n)                (((uint32_t)(n) << 5) & 0x00000020)

// GPIO36 interrupt.
#define REG_GPIO_INT1SET_GPIO36_S                 4
#define REG_GPIO_INT1SET_GPIO36_M                 0x00000010
#define REG_GPIO_INT1SET_GPIO36(n)                (((uint32_t)(n) << 4) & 0x00000010)

// GPIO35 interrupt.
#define REG_GPIO_INT1SET_GPIO35_S                 3
#define REG_GPIO_INT1SET_GPIO35_M                 0x00000008
#define REG_GPIO_INT1SET_GPIO35(n)                (((uint32_t)(n) << 3) & 0x00000008)

// GPIO34 interrupt.
#define REG_GPIO_INT1SET_GPIO34_S                 2
#define REG_GPIO_INT1SET_GPIO34_M                 0x00000004
#define REG_GPIO_INT1SET_GPIO34(n)                (((uint32_t)(n) << 2) & 0x00000004)

// GPIO33 interrupt.
#define REG_GPIO_INT1SET_GPIO33_S                 1
#define REG_GPIO_INT1SET_GPIO33_M                 0x00000002
#define REG_GPIO_INT1SET_GPIO33(n)                (((uint32_t)(n) << 1) & 0x00000002)

// GPIO32 interrupt.
#define REG_GPIO_INT1SET_GPIO32_S                 0
#define REG_GPIO_INT1SET_GPIO32_M                 0x00000001
#define REG_GPIO_INT1SET_GPIO32(n)                (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_PADREGA - Pad Configuration Register A
//
//*****************************************************************************
// Pad 3 function select
#define REG_GPIO_PADREGA_PAD3FNCSEL_S             27
#define REG_GPIO_PADREGA_PAD3FNCSEL_M             0x38000000
#define REG_GPIO_PADREGA_PAD3FNCSEL(n)            (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGA_PAD3FNCSEL_UA0RTS        0x00000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_SLnCE         0x08000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_M1nCE4        0x10000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_GPIO3         0x18000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_MxnCELB       0x20000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_M2nCE0        0x28000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_TRIG1         0x30000000
#define REG_GPIO_PADREGA_PAD3FNCSEL_I2S_WCLK      0x38000000

// Pad 3 drive strength.
#define REG_GPIO_PADREGA_PAD3STRNG_S              26
#define REG_GPIO_PADREGA_PAD3STRNG_M              0x04000000
#define REG_GPIO_PADREGA_PAD3STRNG(n)             (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGA_PAD3STRNG_LOW            0x00000000
#define REG_GPIO_PADREGA_PAD3STRNG_HIGH           0x04000000

// Pad 3 input enable.
#define REG_GPIO_PADREGA_PAD3INPEN_S              25
#define REG_GPIO_PADREGA_PAD3INPEN_M              0x02000000
#define REG_GPIO_PADREGA_PAD3INPEN(n)             (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGA_PAD3INPEN_DIS            0x00000000
#define REG_GPIO_PADREGA_PAD3INPEN_EN             0x02000000

// Pad 3 pullup enable
#define REG_GPIO_PADREGA_PAD3PULL_S               24
#define REG_GPIO_PADREGA_PAD3PULL_M               0x01000000
#define REG_GPIO_PADREGA_PAD3PULL(n)              (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGA_PAD3PULL_DIS             0x00000000
#define REG_GPIO_PADREGA_PAD3PULL_EN              0x01000000

// Pad 2 function select
#define REG_GPIO_PADREGA_PAD2FNCSEL_S             19
#define REG_GPIO_PADREGA_PAD2FNCSEL_M             0x00380000
#define REG_GPIO_PADREGA_PAD2FNCSEL(n)            (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGA_PAD2FNCSEL_SLWIR3        0x00000000
#define REG_GPIO_PADREGA_PAD2FNCSEL_SLMOSI        0x00080000
#define REG_GPIO_PADREGA_PAD2FNCSEL_UART0RX       0x00100000
#define REG_GPIO_PADREGA_PAD2FNCSEL_GPIO2         0x00180000
#define REG_GPIO_PADREGA_PAD2FNCSEL_MxMOSILB      0x00200000
#define REG_GPIO_PADREGA_PAD2FNCSEL_M2MOSI        0x00280000
#define REG_GPIO_PADREGA_PAD2FNCSEL_MxWIR3LB      0x00300000
#define REG_GPIO_PADREGA_PAD2FNCSEL_M2WIR3        0x00380000

// Pad 2 drive strength
#define REG_GPIO_PADREGA_PAD2STRNG_S              18
#define REG_GPIO_PADREGA_PAD2STRNG_M              0x00040000
#define REG_GPIO_PADREGA_PAD2STRNG(n)             (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGA_PAD2STRNG_LOW            0x00000000
#define REG_GPIO_PADREGA_PAD2STRNG_HIGH           0x00040000

// Pad 2 input enable
#define REG_GPIO_PADREGA_PAD2INPEN_S              17
#define REG_GPIO_PADREGA_PAD2INPEN_M              0x00020000
#define REG_GPIO_PADREGA_PAD2INPEN(n)             (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGA_PAD2INPEN_DIS            0x00000000
#define REG_GPIO_PADREGA_PAD2INPEN_EN             0x00020000

// Pad 2 pullup enable
#define REG_GPIO_PADREGA_PAD2PULL_S               16
#define REG_GPIO_PADREGA_PAD2PULL_M               0x00010000
#define REG_GPIO_PADREGA_PAD2PULL(n)              (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGA_PAD2PULL_DIS             0x00000000
#define REG_GPIO_PADREGA_PAD2PULL_EN              0x00010000

// Pad 1 pullup resistor selection.
#define REG_GPIO_PADREGA_PAD1RSEL_S               14
#define REG_GPIO_PADREGA_PAD1RSEL_M               0x0000C000
#define REG_GPIO_PADREGA_PAD1RSEL(n)              (((uint32_t)(n) << 14) & 0x0000C000)
#define REG_GPIO_PADREGA_PAD1RSEL_PULL1_5K        0x00000000
#define REG_GPIO_PADREGA_PAD1RSEL_PULL6K          0x00004000
#define REG_GPIO_PADREGA_PAD1RSEL_PULL12K         0x00008000
#define REG_GPIO_PADREGA_PAD1RSEL_PULL24K         0x0000C000

// Pad 1 function select
#define REG_GPIO_PADREGA_PAD1FNCSEL_S             11
#define REG_GPIO_PADREGA_PAD1FNCSEL_M             0x00003800
#define REG_GPIO_PADREGA_PAD1FNCSEL(n)            (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGA_PAD1FNCSEL_SLSDA         0x00000000
#define REG_GPIO_PADREGA_PAD1FNCSEL_SLMISO        0x00000800
#define REG_GPIO_PADREGA_PAD1FNCSEL_UART0TX       0x00001000
#define REG_GPIO_PADREGA_PAD1FNCSEL_GPIO1         0x00001800
#define REG_GPIO_PADREGA_PAD1FNCSEL_MxMISOLB      0x00002000
#define REG_GPIO_PADREGA_PAD1FNCSEL_M2MISO        0x00002800
#define REG_GPIO_PADREGA_PAD1FNCSEL_MxSDALB       0x00003000
#define REG_GPIO_PADREGA_PAD1FNCSEL_M2SDA         0x00003800

// Pad 1 drive strength
#define REG_GPIO_PADREGA_PAD1STRNG_S              10
#define REG_GPIO_PADREGA_PAD1STRNG_M              0x00000400
#define REG_GPIO_PADREGA_PAD1STRNG(n)             (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGA_PAD1STRNG_LOW            0x00000000
#define REG_GPIO_PADREGA_PAD1STRNG_HIGH           0x00000400

// Pad 1 input enable
#define REG_GPIO_PADREGA_PAD1INPEN_S              9
#define REG_GPIO_PADREGA_PAD1INPEN_M              0x00000200
#define REG_GPIO_PADREGA_PAD1INPEN(n)             (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGA_PAD1INPEN_DIS            0x00000000
#define REG_GPIO_PADREGA_PAD1INPEN_EN             0x00000200

// Pad 1 pullup enable
#define REG_GPIO_PADREGA_PAD1PULL_S               8
#define REG_GPIO_PADREGA_PAD1PULL_M               0x00000100
#define REG_GPIO_PADREGA_PAD1PULL(n)              (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGA_PAD1PULL_DIS             0x00000000
#define REG_GPIO_PADREGA_PAD1PULL_EN              0x00000100

// Pad 0 pullup resistor selection.
#define REG_GPIO_PADREGA_PAD0RSEL_S               6
#define REG_GPIO_PADREGA_PAD0RSEL_M               0x000000C0
#define REG_GPIO_PADREGA_PAD0RSEL(n)              (((uint32_t)(n) << 6) & 0x000000C0)
#define REG_GPIO_PADREGA_PAD0RSEL_PULL1_5K        0x00000000
#define REG_GPIO_PADREGA_PAD0RSEL_PULL6K          0x00000040
#define REG_GPIO_PADREGA_PAD0RSEL_PULL12K         0x00000080
#define REG_GPIO_PADREGA_PAD0RSEL_PULL24K         0x000000C0

// Pad 0 function select
#define REG_GPIO_PADREGA_PAD0FNCSEL_S             3
#define REG_GPIO_PADREGA_PAD0FNCSEL_M             0x00000038
#define REG_GPIO_PADREGA_PAD0FNCSEL(n)            (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGA_PAD0FNCSEL_SLSCL         0x00000000
#define REG_GPIO_PADREGA_PAD0FNCSEL_SLSCK         0x00000008
#define REG_GPIO_PADREGA_PAD0FNCSEL_CLKOUT        0x00000010
#define REG_GPIO_PADREGA_PAD0FNCSEL_GPIO0         0x00000018
#define REG_GPIO_PADREGA_PAD0FNCSEL_MxSCKLB       0x00000020
#define REG_GPIO_PADREGA_PAD0FNCSEL_M2SCK         0x00000028
#define REG_GPIO_PADREGA_PAD0FNCSEL_MxSCLLB       0x00000030
#define REG_GPIO_PADREGA_PAD0FNCSEL_M2SCL         0x00000038

// Pad 0 drive strength
#define REG_GPIO_PADREGA_PAD0STRNG_S              2
#define REG_GPIO_PADREGA_PAD0STRNG_M              0x00000004
#define REG_GPIO_PADREGA_PAD0STRNG(n)             (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGA_PAD0STRNG_LOW            0x00000000
#define REG_GPIO_PADREGA_PAD0STRNG_HIGH           0x00000004

// Pad 0 input enable
#define REG_GPIO_PADREGA_PAD0INPEN_S              1
#define REG_GPIO_PADREGA_PAD0INPEN_M              0x00000002
#define REG_GPIO_PADREGA_PAD0INPEN(n)             (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGA_PAD0INPEN_DIS            0x00000000
#define REG_GPIO_PADREGA_PAD0INPEN_EN             0x00000002

// Pad 0 pullup enable
#define REG_GPIO_PADREGA_PAD0PULL_S               0
#define REG_GPIO_PADREGA_PAD0PULL_M               0x00000001
#define REG_GPIO_PADREGA_PAD0PULL(n)              (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGA_PAD0PULL_DIS             0x00000000
#define REG_GPIO_PADREGA_PAD0PULL_EN              0x00000001

//*****************************************************************************
//
// GPIO_PADREGB - Pad Configuration Register B
//
//*****************************************************************************
// Pad 7 function select
#define REG_GPIO_PADREGB_PAD7FNCSEL_S             27
#define REG_GPIO_PADREGB_PAD7FNCSEL_M             0x38000000
#define REG_GPIO_PADREGB_PAD7FNCSEL(n)            (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGB_PAD7FNCSEL_M0WIR3        0x00000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_M0MOSI        0x08000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_CLKOUT        0x10000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_GPIO7         0x18000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_TRIG0         0x20000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_UART0TX       0x28000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_SLWIR3LB      0x30000000
#define REG_GPIO_PADREGB_PAD7FNCSEL_M1nCE1        0x38000000

// Pad 7 drive strength
#define REG_GPIO_PADREGB_PAD7STRNG_S              26
#define REG_GPIO_PADREGB_PAD7STRNG_M              0x04000000
#define REG_GPIO_PADREGB_PAD7STRNG(n)             (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGB_PAD7STRNG_LOW            0x00000000
#define REG_GPIO_PADREGB_PAD7STRNG_HIGH           0x04000000

// Pad 7 input enable
#define REG_GPIO_PADREGB_PAD7INPEN_S              25
#define REG_GPIO_PADREGB_PAD7INPEN_M              0x02000000
#define REG_GPIO_PADREGB_PAD7INPEN(n)             (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGB_PAD7INPEN_DIS            0x00000000
#define REG_GPIO_PADREGB_PAD7INPEN_EN             0x02000000

