mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 4 input enable
#define REG_GPIO_PADREGB_PAD4INPEN_S              1
#define REG_GPIO_PADREGB_PAD4INPEN_M              0x00000002
#define REG_GPIO_PADREGB_PAD4INPEN(n)             (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGB_PAD4INPEN_DIS            0x00000000
#define REG_GPIO_PADREGB_PAD4INPEN_EN             0x00000002

// Pad 4 pullup enable
#define REG_GPIO_PADREGB_PAD4PULL_S               0
#define REG_GPIO_PADREGB_PAD4PULL_M               0x00000001
#define REG_GPIO_PADREGB_PAD4PULL(n)              (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGB_PAD4PULL_DIS             0x00000000
#define REG_GPIO_PADREGB_PAD4PULL_EN              0x00000001

//*****************************************************************************
//
// GPIO_PADREGC - Pad Configuration Register C
//
//*****************************************************************************
// Pad 11 function select
#define REG_GPIO_PADREGC_PAD11FNCSEL_S            27
#define REG_GPIO_PADREGC_PAD11FNCSEL_M            0x38000000
#define REG_GPIO_PADREGC_PAD11FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGC_PAD11FNCSEL_ADCSE2       0x00000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_M0nCE0       0x08000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_CLKOUT       0x10000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_GPIO11       0x18000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_M2nCE7       0x20000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_UA1CTS       0x28000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_UART0RX      0x30000000
#define REG_GPIO_PADREGC_PAD11FNCSEL_PDM_DATA     0x38000000

// Pad 11 drive strength
#define REG_GPIO_PADREGC_PAD11STRNG_S             26
#define REG_GPIO_PADREGC_PAD11STRNG_M             0x04000000
#define REG_GPIO_PADREGC_PAD11STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGC_PAD11STRNG_LOW           0x00000000
#define REG_GPIO_PADREGC_PAD11STRNG_HIGH          0x04000000

// Pad 11 input enable
#define REG_GPIO_PADREGC_PAD11INPEN_S             25
#define REG_GPIO_PADREGC_PAD11INPEN_M             0x02000000
#define REG_GPIO_PADREGC_PAD11INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGC_PAD11INPEN_DIS           0x00000000
#define REG_GPIO_PADREGC_PAD11INPEN_EN            0x02000000

// Pad 11 pullup enable
#define REG_GPIO_PADREGC_PAD11PULL_S              24
#define REG_GPIO_PADREGC_PAD11PULL_M              0x01000000
#define REG_GPIO_PADREGC_PAD11PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGC_PAD11PULL_DIS            0x00000000
#define REG_GPIO_PADREGC_PAD11PULL_EN             0x01000000

// Pad 10 function select
#define REG_GPIO_PADREGC_PAD10FNCSEL_S            19
#define REG_GPIO_PADREGC_PAD10FNCSEL_M            0x00380000
#define REG_GPIO_PADREGC_PAD10FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGC_PAD10FNCSEL_M1WIR3       0x00000000
#define REG_GPIO_PADREGC_PAD10FNCSEL_M1MOSI       0x00080000
#define REG_GPIO_PADREGC_PAD10FNCSEL_M0nCE6       0x00100000
#define REG_GPIO_PADREGC_PAD10FNCSEL_GPIO10       0x00180000
#define REG_GPIO_PADREGC_PAD10FNCSEL_M2nCE6       0x00200000
#define REG_GPIO_PADREGC_PAD10FNCSEL_UA1RTS       0x00280000
#define REG_GPIO_PADREGC_PAD10FNCSEL_M4nCE4       0x00300000
#define REG_GPIO_PADREGC_PAD10FNCSEL_SLWIR3LB     0x00380000

// Pad 10 drive strength
#define REG_GPIO_PADREGC_PAD10STRNG_S             18
#define REG_GPIO_PADREGC_PAD10STRNG_M             0x00040000
#define REG_GPIO_PADREGC_PAD10STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGC_PAD10STRNG_LOW           0x00000000
#define REG_GPIO_PADREGC_PAD10STRNG_HIGH          0x00040000

// Pad 10 input enable
#define REG_GPIO_PADREGC_PAD10INPEN_S             17
#define REG_GPIO_PADREGC_PAD10INPEN_M             0x00020000
#define REG_GPIO_PADREGC_PAD10INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGC_PAD10INPEN_DIS           0x00000000
#define REG_GPIO_PADREGC_PAD10INPEN_EN            0x00020000

// Pad 10 pullup enable
#define REG_GPIO_PADREGC_PAD10PULL_S              16
#define REG_GPIO_PADREGC_PAD10PULL_M              0x00010000
#define REG_GPIO_PADREGC_PAD10PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGC_PAD10PULL_DIS            0x00000000
#define REG_GPIO_PADREGC_PAD10PULL_EN             0x00010000

// Pad 9 pullup resistor selection
#define REG_GPIO_PADREGC_PAD9RSEL_S               14
#define REG_GPIO_PADREGC_PAD9RSEL_M               0x0000C000
#define REG_GPIO_PADREGC_PAD9RSEL(n)              (((uint32_t)(n) << 14) & 0x0000C000)
#define REG_GPIO_PADREGC_PAD9RSEL_PULL1_5K        0x00000000
#define REG_GPIO_PADREGC_PAD9RSEL_PULL6K          0x00004000
#define REG_GPIO_PADREGC_PAD9RSEL_PULL12K         0x00008000
#define REG_GPIO_PADREGC_PAD9RSEL_PULL24K         0x0000C000

// Pad 9 function select
#define REG_GPIO_PADREGC_PAD9FNCSEL_S             11
#define REG_GPIO_PADREGC_PAD9FNCSEL_M             0x00003800
#define REG_GPIO_PADREGC_PAD9FNCSEL(n)            (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGC_PAD9FNCSEL_M1SDA         0x00000000
#define REG_GPIO_PADREGC_PAD9FNCSEL_M1MISO        0x00000800
#define REG_GPIO_PADREGC_PAD9FNCSEL_M0nCE5        0x00001000
#define REG_GPIO_PADREGC_PAD9FNCSEL_GPIO9         0x00001800
#define REG_GPIO_PADREGC_PAD9FNCSEL_M4nCE5        0x00002000
#define REG_GPIO_PADREGC_PAD9FNCSEL_SLMISOLB      0x00002800
#define REG_GPIO_PADREGC_PAD9FNCSEL_UART1RX       0x00003000
#define REG_GPIO_PADREGC_PAD9FNCSEL_SLSDALB       0x00003800

// Pad 9 drive strength
#define REG_GPIO_PADREGC_PAD9STRNG_S              10
#define REG_GPIO_PADREGC_PAD9STRNG_M              0x00000400
#define REG_GPIO_PADREGC_PAD9STRNG(n)             (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGC_PAD9STRNG_LOW            0x00000000
#define REG_GPIO_PADREGC_PAD9STRNG_HIGH           0x00000400

// Pad 9 input enable
#define REG_GPIO_PADREGC_PAD9INPEN_S              9
#define REG_GPIO_PADREGC_PAD9INPEN_M              0x00000200
#define REG_GPIO_PADREGC_PAD9INPEN(n)             (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGC_PAD9INPEN_DIS            0x00000000
#define REG_GPIO_PADREGC_PAD9INPEN_EN             0x00000200

// Pad 9 pullup enable
#define REG_GPIO_PADREGC_PAD9PULL_S               8
#define REG_GPIO_PADREGC_PAD9PULL_M               0x00000100
#define REG_GPIO_PADREGC_PAD9PULL(n)              (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGC_PAD9PULL_DIS             0x00000000
#define REG_GPIO_PADREGC_PAD9PULL_EN              0x00000100

// Pad 8 pullup resistor selection.
#define REG_GPIO_PADREGC_PAD8RSEL_S               6
#define REG_GPIO_PADREGC_PAD8RSEL_M               0x000000C0
#define REG_GPIO_PADREGC_PAD8RSEL(n)              (((uint32_t)(n) << 6) & 0x000000C0)
#define REG_GPIO_PADREGC_PAD8RSEL_PULL1_5K        0x00000000
#define REG_GPIO_PADREGC_PAD8RSEL_PULL6K          0x00000040
#define REG_GPIO_PADREGC_PAD8RSEL_PULL12K         0x00000080
#define REG_GPIO_PADREGC_PAD8RSEL_PULL24K         0x000000C0

// Pad 8 function select
#define REG_GPIO_PADREGC_PAD8FNCSEL_S             3
#define REG_GPIO_PADREGC_PAD8FNCSEL_M             0x00000038
#define REG_GPIO_PADREGC_PAD8FNCSEL(n)            (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGC_PAD8FNCSEL_M1SCL         0x00000000
#define REG_GPIO_PADREGC_PAD8FNCSEL_M1SCK         0x00000008
#define REG_GPIO_PADREGC_PAD8FNCSEL_M0nCE4        0x00000010
#define REG_GPIO_PADREGC_PAD8FNCSEL_GPIO8         0x00000018
#define REG_GPIO_PADREGC_PAD8FNCSEL_M2nCE4        0x00000020
#define REG_GPIO_PADREGC_PAD8FNCSEL_M1SCKLB       0x00000028
#define REG_GPIO_PADREGC_PAD8FNCSEL_UART1TX       0x00000030
#define REG_GPIO_PADREGC_PAD8FNCSEL_M1SCLLB       0x00000038

