mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 8 drive strength
#define REG_GPIO_PADREGC_PAD8STRNG_S              2
#define REG_GPIO_PADREGC_PAD8STRNG_M              0x00000004
#define REG_GPIO_PADREGC_PAD8STRNG(n)             (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGC_PAD8STRNG_LOW            0x00000000
#define REG_GPIO_PADREGC_PAD8STRNG_HIGH           0x00000004

// Pad 8 input enable
#define REG_GPIO_PADREGC_PAD8INPEN_S              1
#define REG_GPIO_PADREGC_PAD8INPEN_M              0x00000002
#define REG_GPIO_PADREGC_PAD8INPEN(n)             (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGC_PAD8INPEN_DIS            0x00000000
#define REG_GPIO_PADREGC_PAD8INPEN_EN             0x00000002

// Pad 8 pullup enable
#define REG_GPIO_PADREGC_PAD8PULL_S               0
#define REG_GPIO_PADREGC_PAD8PULL_M               0x00000001
#define REG_GPIO_PADREGC_PAD8PULL(n)              (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGC_PAD8PULL_DIS             0x00000000
#define REG_GPIO_PADREGC_PAD8PULL_EN              0x00000001

//*****************************************************************************
//
// GPIO_PADREGD - Pad Configuration Register D
//
//*****************************************************************************
// Pad 15 function select
#define REG_GPIO_PADREGD_PAD15FNCSEL_S            27
#define REG_GPIO_PADREGD_PAD15FNCSEL_M            0x38000000
#define REG_GPIO_PADREGD_PAD15FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGD_PAD15FNCSEL_ADCD1N       0x00000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_M1nCE3       0x08000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_UART1RX      0x10000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_GPIO15       0x18000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_M2nCE2       0x20000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_EXTXT        0x28000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_SWDIO        0x30000000
#define REG_GPIO_PADREGD_PAD15FNCSEL_SWO          0x38000000

// Pad 15 drive strength
#define REG_GPIO_PADREGD_PAD15STRNG_S             26
#define REG_GPIO_PADREGD_PAD15STRNG_M             0x04000000
#define REG_GPIO_PADREGD_PAD15STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGD_PAD15STRNG_LOW           0x00000000
#define REG_GPIO_PADREGD_PAD15STRNG_HIGH          0x04000000

// Pad 15 input enable
#define REG_GPIO_PADREGD_PAD15INPEN_S             25
#define REG_GPIO_PADREGD_PAD15INPEN_M             0x02000000
#define REG_GPIO_PADREGD_PAD15INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGD_PAD15INPEN_DIS           0x00000000
#define REG_GPIO_PADREGD_PAD15INPEN_EN            0x02000000

// Pad 15 pullup enable
#define REG_GPIO_PADREGD_PAD15PULL_S              24
#define REG_GPIO_PADREGD_PAD15PULL_M              0x01000000
#define REG_GPIO_PADREGD_PAD15PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGD_PAD15PULL_DIS            0x00000000
#define REG_GPIO_PADREGD_PAD15PULL_EN             0x01000000

// Pad 14 function select
#define REG_GPIO_PADREGD_PAD14FNCSEL_S            19
#define REG_GPIO_PADREGD_PAD14FNCSEL_M            0x00380000
#define REG_GPIO_PADREGD_PAD14FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGD_PAD14FNCSEL_ADCD1P       0x00000000
#define REG_GPIO_PADREGD_PAD14FNCSEL_M1nCE2       0x00080000
#define REG_GPIO_PADREGD_PAD14FNCSEL_UART1TX      0x00100000
#define REG_GPIO_PADREGD_PAD14FNCSEL_GPIO14       0x00180000
#define REG_GPIO_PADREGD_PAD14FNCSEL_M2nCE1       0x00200000
#define REG_GPIO_PADREGD_PAD14FNCSEL_EXTHFS       0x00280000
#define REG_GPIO_PADREGD_PAD14FNCSEL_SWDCK        0x00300000
#define REG_GPIO_PADREGD_PAD14FNCSEL_32khz_XT     0x00380000

// Pad 14 drive strength
#define REG_GPIO_PADREGD_PAD14STRNG_S             18
#define REG_GPIO_PADREGD_PAD14STRNG_M             0x00040000
#define REG_GPIO_PADREGD_PAD14STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGD_PAD14STRNG_LOW           0x00000000
#define REG_GPIO_PADREGD_PAD14STRNG_HIGH          0x00040000

// Pad 14 input enable
#define REG_GPIO_PADREGD_PAD14INPEN_S             17
#define REG_GPIO_PADREGD_PAD14INPEN_M             0x00020000
#define REG_GPIO_PADREGD_PAD14INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGD_PAD14INPEN_DIS           0x00000000
#define REG_GPIO_PADREGD_PAD14INPEN_EN            0x00020000

// Pad 14 pullup enable
#define REG_GPIO_PADREGD_PAD14PULL_S              16
#define REG_GPIO_PADREGD_PAD14PULL_M              0x00010000
#define REG_GPIO_PADREGD_PAD14PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGD_PAD14PULL_DIS            0x00000000
#define REG_GPIO_PADREGD_PAD14PULL_EN             0x00010000

// Pad 13 function select
#define REG_GPIO_PADREGD_PAD13FNCSEL_S            11
#define REG_GPIO_PADREGD_PAD13FNCSEL_M            0x00003800
#define REG_GPIO_PADREGD_PAD13FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGD_PAD13FNCSEL_ADCD0PSE8    0x00000000
#define REG_GPIO_PADREGD_PAD13FNCSEL_M1nCE1       0x00000800
#define REG_GPIO_PADREGD_PAD13FNCSEL_TCTB0        0x00001000
#define REG_GPIO_PADREGD_PAD13FNCSEL_GPIO13       0x00001800
#define REG_GPIO_PADREGD_PAD13FNCSEL_M2nCE3       0x00002000
#define REG_GPIO_PADREGD_PAD13FNCSEL_EXTHFB       0x00002800
#define REG_GPIO_PADREGD_PAD13FNCSEL_UA0RTS       0x00003000
#define REG_GPIO_PADREGD_PAD13FNCSEL_UART1RX      0x00003800

// Pad 13 drive strength
#define REG_GPIO_PADREGD_PAD13STRNG_S             10
#define REG_GPIO_PADREGD_PAD13STRNG_M             0x00000400
#define REG_GPIO_PADREGD_PAD13STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGD_PAD13STRNG_LOW           0x00000000
#define REG_GPIO_PADREGD_PAD13STRNG_HIGH          0x00000400

// Pad 13 input enable
#define REG_GPIO_PADREGD_PAD13INPEN_S             9
#define REG_GPIO_PADREGD_PAD13INPEN_M             0x00000200
#define REG_GPIO_PADREGD_PAD13INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGD_PAD13INPEN_DIS           0x00000000
#define REG_GPIO_PADREGD_PAD13INPEN_EN            0x00000200

