mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 13 pullup enable
#define REG_GPIO_PADREGD_PAD13PULL_S              8
#define REG_GPIO_PADREGD_PAD13PULL_M              0x00000100
#define REG_GPIO_PADREGD_PAD13PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGD_PAD13PULL_DIS            0x00000000
#define REG_GPIO_PADREGD_PAD13PULL_EN             0x00000100

// Pad 12 function select
#define REG_GPIO_PADREGD_PAD12FNCSEL_S            3
#define REG_GPIO_PADREGD_PAD12FNCSEL_M            0x00000038
#define REG_GPIO_PADREGD_PAD12FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGD_PAD12FNCSEL_ADCD0NSE9    0x00000000
#define REG_GPIO_PADREGD_PAD12FNCSEL_M1nCE0       0x00000008
#define REG_GPIO_PADREGD_PAD12FNCSEL_TCTA0        0x00000010
#define REG_GPIO_PADREGD_PAD12FNCSEL_GPIO12       0x00000018
#define REG_GPIO_PADREGD_PAD12FNCSEL_CLKOUT       0x00000020
#define REG_GPIO_PADREGD_PAD12FNCSEL_PDM_CLK      0x00000028
#define REG_GPIO_PADREGD_PAD12FNCSEL_UA0CTS       0x00000030
#define REG_GPIO_PADREGD_PAD12FNCSEL_UART1TX      0x00000038

// Pad 12 drive strength
#define REG_GPIO_PADREGD_PAD12STRNG_S             2
#define REG_GPIO_PADREGD_PAD12STRNG_M             0x00000004
#define REG_GPIO_PADREGD_PAD12STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGD_PAD12STRNG_LOW           0x00000000
#define REG_GPIO_PADREGD_PAD12STRNG_HIGH          0x00000004

// Pad 12 input enable
#define REG_GPIO_PADREGD_PAD12INPEN_S             1
#define REG_GPIO_PADREGD_PAD12INPEN_M             0x00000002
#define REG_GPIO_PADREGD_PAD12INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGD_PAD12INPEN_DIS           0x00000000
#define REG_GPIO_PADREGD_PAD12INPEN_EN            0x00000002

// Pad 12 pullup enable
#define REG_GPIO_PADREGD_PAD12PULL_S              0
#define REG_GPIO_PADREGD_PAD12PULL_M              0x00000001
#define REG_GPIO_PADREGD_PAD12PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGD_PAD12PULL_DIS            0x00000000
#define REG_GPIO_PADREGD_PAD12PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGE - Pad Configuration Register E
//
//*****************************************************************************
// Pad 19 function select
#define REG_GPIO_PADREGE_PAD19FNCSEL_S            27
#define REG_GPIO_PADREGE_PAD19FNCSEL_M            0x38000000
#define REG_GPIO_PADREGE_PAD19FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGE_PAD19FNCSEL_CMPRF0       0x00000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_M0nCE3       0x08000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_TCTB1        0x10000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_GPIO19       0x18000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_TCTA1        0x20000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_ANATEST1     0x28000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_UART1RX      0x30000000
#define REG_GPIO_PADREGE_PAD19FNCSEL_I2S_BCLK     0x38000000

// Pad 19 drive strength
#define REG_GPIO_PADREGE_PAD19STRNG_S             26
#define REG_GPIO_PADREGE_PAD19STRNG_M             0x04000000
#define REG_GPIO_PADREGE_PAD19STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGE_PAD19STRNG_LOW           0x00000000
#define REG_GPIO_PADREGE_PAD19STRNG_HIGH          0x04000000

// Pad 19 input enable
#define REG_GPIO_PADREGE_PAD19INPEN_S             25
#define REG_GPIO_PADREGE_PAD19INPEN_M             0x02000000
#define REG_GPIO_PADREGE_PAD19INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGE_PAD19INPEN_DIS           0x00000000
#define REG_GPIO_PADREGE_PAD19INPEN_EN            0x02000000

// Pad 19 pullup enable
#define REG_GPIO_PADREGE_PAD19PULL_S              24
#define REG_GPIO_PADREGE_PAD19PULL_M              0x01000000
#define REG_GPIO_PADREGE_PAD19PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGE_PAD19PULL_DIS            0x00000000
#define REG_GPIO_PADREGE_PAD19PULL_EN             0x01000000

// Pad 18 function select
#define REG_GPIO_PADREGE_PAD18FNCSEL_S            19
#define REG_GPIO_PADREGE_PAD18FNCSEL_M            0x00380000
#define REG_GPIO_PADREGE_PAD18FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGE_PAD18FNCSEL_CMPIN1       0x00000000
#define REG_GPIO_PADREGE_PAD18FNCSEL_M0nCE2       0x00080000
#define REG_GPIO_PADREGE_PAD18FNCSEL_TCTA1        0x00100000
#define REG_GPIO_PADREGE_PAD18FNCSEL_GPIO18       0x00180000
#define REG_GPIO_PADREGE_PAD18FNCSEL_M4nCE1       0x00200000
#define REG_GPIO_PADREGE_PAD18FNCSEL_ANATEST2     0x00280000
#define REG_GPIO_PADREGE_PAD18FNCSEL_UART1TX      0x00300000
#define REG_GPIO_PADREGE_PAD18FNCSEL_32khz_XT     0x00380000

// Pad 18 drive strength
#define REG_GPIO_PADREGE_PAD18STRNG_S             18
#define REG_GPIO_PADREGE_PAD18STRNG_M             0x00040000
#define REG_GPIO_PADREGE_PAD18STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGE_PAD18STRNG_LOW           0x00000000
#define REG_GPIO_PADREGE_PAD18STRNG_HIGH          0x00040000

// Pad 18 input enable
#define REG_GPIO_PADREGE_PAD18INPEN_S             17
#define REG_GPIO_PADREGE_PAD18INPEN_M             0x00020000
#define REG_GPIO_PADREGE_PAD18INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGE_PAD18INPEN_DIS           0x00000000
#define REG_GPIO_PADREGE_PAD18INPEN_EN            0x00020000

// Pad 18 pullup enable
#define REG_GPIO_PADREGE_PAD18PULL_S              16
#define REG_GPIO_PADREGE_PAD18PULL_M              0x00010000
#define REG_GPIO_PADREGE_PAD18PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGE_PAD18PULL_DIS            0x00000000
#define REG_GPIO_PADREGE_PAD18PULL_EN             0x00010000

// Pad 17 function select
#define REG_GPIO_PADREGE_PAD17FNCSEL_S            11
#define REG_GPIO_PADREGE_PAD17FNCSEL_M            0x00003800
#define REG_GPIO_PADREGE_PAD17FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGE_PAD17FNCSEL_CMPRF1       0x00000000
#define REG_GPIO_PADREGE_PAD17FNCSEL_M0nCE1       0x00000800
#define REG_GPIO_PADREGE_PAD17FNCSEL_TRIG1        0x00001000
#define REG_GPIO_PADREGE_PAD17FNCSEL_GPIO17       0x00001800
#define REG_GPIO_PADREGE_PAD17FNCSEL_M4nCE3       0x00002000
#define REG_GPIO_PADREGE_PAD17FNCSEL_EXTLF        0x00002800
#define REG_GPIO_PADREGE_PAD17FNCSEL_UART0RX      0x00003000
#define REG_GPIO_PADREGE_PAD17FNCSEL_UA1CTS       0x00003800

// Pad 17 drive strength
#define REG_GPIO_PADREGE_PAD17STRNG_S             10
#define REG_GPIO_PADREGE_PAD17STRNG_M             0x00000400
#define REG_GPIO_PADREGE_PAD17STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGE_PAD17STRNG_LOW           0x00000000
#define REG_GPIO_PADREGE_PAD17STRNG_HIGH          0x00000400

// Pad 17 input enable
#define REG_GPIO_PADREGE_PAD17INPEN_S             9
#define REG_GPIO_PADREGE_PAD17INPEN_M             0x00000200
#define REG_GPIO_PADREGE_PAD17INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGE_PAD17INPEN_DIS           0x00000000
#define REG_GPIO_PADREGE_PAD17INPEN_EN            0x00000200

// Pad 17 pullup enable
#define REG_GPIO_PADREGE_PAD17PULL_S              8
#define REG_GPIO_PADREGE_PAD17PULL_M              0x00000100
#define REG_GPIO_PADREGE_PAD17PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGE_PAD17PULL_DIS            0x00000000
#define REG_GPIO_PADREGE_PAD17PULL_EN             0x00000100

// Pad 16 function select
#define REG_GPIO_PADREGE_PAD16FNCSEL_S            3
#define REG_GPIO_PADREGE_PAD16FNCSEL_M            0x00000038
#define REG_GPIO_PADREGE_PAD16FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGE_PAD16FNCSEL_ADCSE0       0x00000000
#define REG_GPIO_PADREGE_PAD16FNCSEL_M0nCE4       0x00000008
#define REG_GPIO_PADREGE_PAD16FNCSEL_TRIG0        0x00000010
#define REG_GPIO_PADREGE_PAD16FNCSEL_GPIO16       0x00000018
#define REG_GPIO_PADREGE_PAD16FNCSEL_M2nCE3       0x00000020
#define REG_GPIO_PADREGE_PAD16FNCSEL_CMPIN0       0x00000028
#define REG_GPIO_PADREGE_PAD16FNCSEL_UART0TX      0x00000030
#define REG_GPIO_PADREGE_PAD16FNCSEL_UA1RTS       0x00000038

// Pad 16 drive strength
#define REG_GPIO_PADREGE_PAD16STRNG_S             2
#define REG_GPIO_PADREGE_PAD16STRNG_M             0x00000004
#define REG_GPIO_PADREGE_PAD16STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGE_PAD16STRNG_LOW           0x00000000
#define REG_GPIO_PADREGE_PAD16STRNG_HIGH          0x00000004

// Pad 16 input enable
#define REG_GPIO_PADREGE_PAD16INPEN_S             1
#define REG_GPIO_PADREGE_PAD16INPEN_M             0x00000002
#define REG_GPIO_PADREGE_PAD16INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGE_PAD16INPEN_DIS           0x00000000
#define REG_GPIO_PADREGE_PAD16INPEN_EN            0x00000002

// Pad 16 pullup enable
#define REG_GPIO_PADREGE_PAD16PULL_S              0
#define REG_GPIO_PADREGE_PAD16PULL_M              0x00000001
#define REG_GPIO_PADREGE_PAD16PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGE_PAD16PULL_DIS            0x00000000
#define REG_GPIO_PADREGE_PAD16PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGF - Pad Configuration Register F
//
//*****************************************************************************
// Pad 23 function select
#define REG_GPIO_PADREGF_PAD23FNCSEL_S            27
#define REG_GPIO_PADREGF_PAD23FNCSEL_M            0x38000000
#define REG_GPIO_PADREGF_PAD23FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGF_PAD23FNCSEL_UART0RX      0x00000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_M0nCE0       0x08000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_TCTB3        0x10000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_GPIO23       0x18000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_PDM_DATA     0x20000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_CMPOUT       0x28000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_TCTB1        0x30000000
#define REG_GPIO_PADREGF_PAD23FNCSEL_UNDEF7       0x38000000

// Pad 23 drive strength
#define REG_GPIO_PADREGF_PAD23STRNG_S             26
#define REG_GPIO_PADREGF_PAD23STRNG_M             0x04000000
#define REG_GPIO_PADREGF_PAD23STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGF_PAD23STRNG_LOW           0x00000000
#define REG_GPIO_PADREGF_PAD23STRNG_HIGH          0x04000000

// Pad 23 input enable
#define REG_GPIO_PADREGF_PAD23INPEN_S             25
#define REG_GPIO_PADREGF_PAD23INPEN_M             0x02000000
#define REG_GPIO_PADREGF_PAD23INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGF_PAD23INPEN_DIS           0x00000000
#define REG_GPIO_PADREGF_PAD23INPEN_EN            0x02000000

// Pad 23 pullup enable
#define REG_GPIO_PADREGF_PAD23PULL_S              24
#define REG_GPIO_PADREGF_PAD23PULL_M              0x01000000
#define REG_GPIO_PADREGF_PAD23PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGF_PAD23PULL_DIS            0x00000000
#define REG_GPIO_PADREGF_PAD23PULL_EN             0x01000000

