mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 22  upper power switch enable
#define REG_GPIO_PADREGF_PAD22PWRUP_S             23
#define REG_GPIO_PADREGF_PAD22PWRUP_M             0x00800000
#define REG_GPIO_PADREGF_PAD22PWRUP(n)            (((uint32_t)(n) << 23) & 0x00800000)
#define REG_GPIO_PADREGF_PAD22PWRUP_DIS           0x00000000
#define REG_GPIO_PADREGF_PAD22PWRUP_EN            0x00800000

// Pad 22 function select
#define REG_GPIO_PADREGF_PAD22FNCSEL_S            19
#define REG_GPIO_PADREGF_PAD22FNCSEL_M            0x00380000
#define REG_GPIO_PADREGF_PAD22FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGF_PAD22FNCSEL_UART0TX      0x00000000
#define REG_GPIO_PADREGF_PAD22FNCSEL_M1nCE7       0x00080000
#define REG_GPIO_PADREGF_PAD22FNCSEL_TCTA3        0x00100000
#define REG_GPIO_PADREGF_PAD22FNCSEL_GPIO22       0x00180000
#define REG_GPIO_PADREGF_PAD22FNCSEL_PDM_CLK      0x00200000
#define REG_GPIO_PADREGF_PAD22FNCSEL_UNDEF5       0x00280000
#define REG_GPIO_PADREGF_PAD22FNCSEL_TCTB1        0x00300000
#define REG_GPIO_PADREGF_PAD22FNCSEL_SWO          0x00380000

// Pad 22 drive strength
#define REG_GPIO_PADREGF_PAD22STRNG_S             18
#define REG_GPIO_PADREGF_PAD22STRNG_M             0x00040000
#define REG_GPIO_PADREGF_PAD22STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGF_PAD22STRNG_LOW           0x00000000
#define REG_GPIO_PADREGF_PAD22STRNG_HIGH          0x00040000

// Pad 22 input enable
#define REG_GPIO_PADREGF_PAD22INPEN_S             17
#define REG_GPIO_PADREGF_PAD22INPEN_M             0x00020000
#define REG_GPIO_PADREGF_PAD22INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGF_PAD22INPEN_DIS           0x00000000
#define REG_GPIO_PADREGF_PAD22INPEN_EN            0x00020000

// Pad 22 pullup enable
#define REG_GPIO_PADREGF_PAD22PULL_S              16
#define REG_GPIO_PADREGF_PAD22PULL_M              0x00010000
#define REG_GPIO_PADREGF_PAD22PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGF_PAD22PULL_DIS            0x00000000
#define REG_GPIO_PADREGF_PAD22PULL_EN             0x00010000

// Pad 21 function select
#define REG_GPIO_PADREGF_PAD21FNCSEL_S            11
#define REG_GPIO_PADREGF_PAD21FNCSEL_M            0x00003800
#define REG_GPIO_PADREGF_PAD21FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGF_PAD21FNCSEL_SWDIO        0x00000000
#define REG_GPIO_PADREGF_PAD21FNCSEL_M1nCE6       0x00000800
#define REG_GPIO_PADREGF_PAD21FNCSEL_TCTB2        0x00001000
#define REG_GPIO_PADREGF_PAD21FNCSEL_GPIO21       0x00001800
#define REG_GPIO_PADREGF_PAD21FNCSEL_UART0RX      0x00002000
#define REG_GPIO_PADREGF_PAD21FNCSEL_UART1RX      0x00002800
#define REG_GPIO_PADREGF_PAD21FNCSEL_UNDEF6       0x00003000
#define REG_GPIO_PADREGF_PAD21FNCSEL_UNDEF7       0x00003800

// Pad 21 drive strength
#define REG_GPIO_PADREGF_PAD21STRNG_S             10
#define REG_GPIO_PADREGF_PAD21STRNG_M             0x00000400
#define REG_GPIO_PADREGF_PAD21STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGF_PAD21STRNG_LOW           0x00000000
#define REG_GPIO_PADREGF_PAD21STRNG_HIGH          0x00000400

// Pad 21 input enable
#define REG_GPIO_PADREGF_PAD21INPEN_S             9
#define REG_GPIO_PADREGF_PAD21INPEN_M             0x00000200
#define REG_GPIO_PADREGF_PAD21INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGF_PAD21INPEN_DIS           0x00000000
#define REG_GPIO_PADREGF_PAD21INPEN_EN            0x00000200

// Pad 21 pullup enable
#define REG_GPIO_PADREGF_PAD21PULL_S              8
#define REG_GPIO_PADREGF_PAD21PULL_M              0x00000100
#define REG_GPIO_PADREGF_PAD21PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGF_PAD21PULL_DIS            0x00000000
#define REG_GPIO_PADREGF_PAD21PULL_EN             0x00000100

// Pad 20 function select
#define REG_GPIO_PADREGF_PAD20FNCSEL_S            3
#define REG_GPIO_PADREGF_PAD20FNCSEL_M            0x00000038
#define REG_GPIO_PADREGF_PAD20FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGF_PAD20FNCSEL_SWDCK        0x00000000
#define REG_GPIO_PADREGF_PAD20FNCSEL_M1nCE5       0x00000008
#define REG_GPIO_PADREGF_PAD20FNCSEL_TCTA2        0x00000010
#define REG_GPIO_PADREGF_PAD20FNCSEL_GPIO20       0x00000018
#define REG_GPIO_PADREGF_PAD20FNCSEL_UART0TX      0x00000020
#define REG_GPIO_PADREGF_PAD20FNCSEL_UART1TX      0x00000028
#define REG_GPIO_PADREGF_PAD20FNCSEL_UNDEF6       0x00000030
#define REG_GPIO_PADREGF_PAD20FNCSEL_UNDEF7       0x00000038

// Pad 20 drive strength
#define REG_GPIO_PADREGF_PAD20STRNG_S             2
#define REG_GPIO_PADREGF_PAD20STRNG_M             0x00000004
#define REG_GPIO_PADREGF_PAD20STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGF_PAD20STRNG_LOW           0x00000000
#define REG_GPIO_PADREGF_PAD20STRNG_HIGH          0x00000004

// Pad 20 input enable
#define REG_GPIO_PADREGF_PAD20INPEN_S             1
#define REG_GPIO_PADREGF_PAD20INPEN_M             0x00000002
#define REG_GPIO_PADREGF_PAD20INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGF_PAD20INPEN_DIS           0x00000000
#define REG_GPIO_PADREGF_PAD20INPEN_EN            0x00000002

// Pad 20 pulldown enable
#define REG_GPIO_PADREGF_PAD20PULL_S              0
#define REG_GPIO_PADREGF_PAD20PULL_M              0x00000001
#define REG_GPIO_PADREGF_PAD20PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGF_PAD20PULL_DIS            0x00000000
#define REG_GPIO_PADREGF_PAD20PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGG - Pad Configuration Register G
//
//*****************************************************************************
// Pad 27 pullup resistor selection.
#define REG_GPIO_PADREGG_PAD27RSEL_S              30
#define REG_GPIO_PADREGG_PAD27RSEL_M              0xC0000000
#define REG_GPIO_PADREGG_PAD27RSEL(n)             (((uint32_t)(n) << 30) & 0xC0000000)
#define REG_GPIO_PADREGG_PAD27RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGG_PAD27RSEL_PULL6K         0x40000000
#define REG_GPIO_PADREGG_PAD27RSEL_PULL12K        0x80000000
#define REG_GPIO_PADREGG_PAD27RSEL_PULL24K        0xC0000000

// Pad 27 function select
#define REG_GPIO_PADREGG_PAD27FNCSEL_S            27
#define REG_GPIO_PADREGG_PAD27FNCSEL_M            0x38000000
#define REG_GPIO_PADREGG_PAD27FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGG_PAD27FNCSEL_EXTHF        0x00000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_M1nCE4       0x08000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_TCTA1        0x10000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_GPIO27       0x18000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_M2SCL        0x20000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_M2SCK        0x28000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_M2SCKLB      0x30000000
#define REG_GPIO_PADREGG_PAD27FNCSEL_M2SCLLB      0x38000000

// Pad 27 drive strength
#define REG_GPIO_PADREGG_PAD27STRNG_S             26
#define REG_GPIO_PADREGG_PAD27STRNG_M             0x04000000
#define REG_GPIO_PADREGG_PAD27STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGG_PAD27STRNG_LOW           0x00000000
#define REG_GPIO_PADREGG_PAD27STRNG_HIGH          0x04000000

// Pad 27 input enable
#define REG_GPIO_PADREGG_PAD27INPEN_S             25
#define REG_GPIO_PADREGG_PAD27INPEN_M             0x02000000
#define REG_GPIO_PADREGG_PAD27INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGG_PAD27INPEN_DIS           0x00000000
#define REG_GPIO_PADREGG_PAD27INPEN_EN            0x02000000

// Pad 27 pullup enable
#define REG_GPIO_PADREGG_PAD27PULL_S              24
#define REG_GPIO_PADREGG_PAD27PULL_M              0x01000000
#define REG_GPIO_PADREGG_PAD27PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGG_PAD27PULL_DIS            0x00000000
#define REG_GPIO_PADREGG_PAD27PULL_EN             0x01000000

