mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 26 function select
#define REG_GPIO_PADREGG_PAD26FNCSEL_S            19
#define REG_GPIO_PADREGG_PAD26FNCSEL_M            0x00380000
#define REG_GPIO_PADREGG_PAD26FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGG_PAD26FNCSEL_EXTLF        0x00000000
#define REG_GPIO_PADREGG_PAD26FNCSEL_M0nCE3       0x00080000
#define REG_GPIO_PADREGG_PAD26FNCSEL_TCTB0        0x00100000
#define REG_GPIO_PADREGG_PAD26FNCSEL_GPIO26       0x00180000
#define REG_GPIO_PADREGG_PAD26FNCSEL_M2nCE0       0x00200000
#define REG_GPIO_PADREGG_PAD26FNCSEL_TCTA1        0x00280000
#define REG_GPIO_PADREGG_PAD26FNCSEL_M5nCE1       0x00300000
#define REG_GPIO_PADREGG_PAD26FNCSEL_M3nCE0       0x00380000

// Pad 26 drive strength
#define REG_GPIO_PADREGG_PAD26STRNG_S             18
#define REG_GPIO_PADREGG_PAD26STRNG_M             0x00040000
#define REG_GPIO_PADREGG_PAD26STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGG_PAD26STRNG_LOW           0x00000000
#define REG_GPIO_PADREGG_PAD26STRNG_HIGH          0x00040000

// Pad 26 input enable
#define REG_GPIO_PADREGG_PAD26INPEN_S             17
#define REG_GPIO_PADREGG_PAD26INPEN_M             0x00020000
#define REG_GPIO_PADREGG_PAD26INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGG_PAD26INPEN_DIS           0x00000000
#define REG_GPIO_PADREGG_PAD26INPEN_EN            0x00020000

// Pad 26 pullup enable
#define REG_GPIO_PADREGG_PAD26PULL_S              16
#define REG_GPIO_PADREGG_PAD26PULL_M              0x00010000
#define REG_GPIO_PADREGG_PAD26PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGG_PAD26PULL_DIS            0x00000000
#define REG_GPIO_PADREGG_PAD26PULL_EN             0x00010000

// Pad 25 pullup resistor selection.
#define REG_GPIO_PADREGG_PAD25RSEL_S              14
#define REG_GPIO_PADREGG_PAD25RSEL_M              0x0000C000
#define REG_GPIO_PADREGG_PAD25RSEL(n)             (((uint32_t)(n) << 14) & 0x0000C000)
#define REG_GPIO_PADREGG_PAD25RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGG_PAD25RSEL_PULL6K         0x00004000
#define REG_GPIO_PADREGG_PAD25RSEL_PULL12K        0x00008000
#define REG_GPIO_PADREGG_PAD25RSEL_PULL24K        0x0000C000

// Pad 25 function select
#define REG_GPIO_PADREGG_PAD25FNCSEL_S            11
#define REG_GPIO_PADREGG_PAD25FNCSEL_M            0x00003800
#define REG_GPIO_PADREGG_PAD25FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGG_PAD25FNCSEL_EXTXT        0x00000000
#define REG_GPIO_PADREGG_PAD25FNCSEL_M0nCE2       0x00000800
#define REG_GPIO_PADREGG_PAD25FNCSEL_TCTA0        0x00001000
#define REG_GPIO_PADREGG_PAD25FNCSEL_GPIO25       0x00001800
#define REG_GPIO_PADREGG_PAD25FNCSEL_M2SDA        0x00002000
#define REG_GPIO_PADREGG_PAD25FNCSEL_M2MISO       0x00002800
#define REG_GPIO_PADREGG_PAD25FNCSEL_SLMISOLB     0x00003000
#define REG_GPIO_PADREGG_PAD25FNCSEL_SLSDALB      0x00003800

// Pad 25 drive strength
#define REG_GPIO_PADREGG_PAD25STRNG_S             10
#define REG_GPIO_PADREGG_PAD25STRNG_M             0x00000400
#define REG_GPIO_PADREGG_PAD25STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGG_PAD25STRNG_LOW           0x00000000
#define REG_GPIO_PADREGG_PAD25STRNG_HIGH          0x00000400

// Pad 25 input enable
#define REG_GPIO_PADREGG_PAD25INPEN_S             9
#define REG_GPIO_PADREGG_PAD25INPEN_M             0x00000200
#define REG_GPIO_PADREGG_PAD25INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGG_PAD25INPEN_DIS           0x00000000
#define REG_GPIO_PADREGG_PAD25INPEN_EN            0x00000200

// Pad 25 pullup enable
#define REG_GPIO_PADREGG_PAD25PULL_S              8
#define REG_GPIO_PADREGG_PAD25PULL_M              0x00000100
#define REG_GPIO_PADREGG_PAD25PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGG_PAD25PULL_DIS            0x00000000
#define REG_GPIO_PADREGG_PAD25PULL_EN             0x00000100

// Pad 24 function select
#define REG_GPIO_PADREGG_PAD24FNCSEL_S            3
#define REG_GPIO_PADREGG_PAD24FNCSEL_M            0x00000038
#define REG_GPIO_PADREGG_PAD24FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGG_PAD24FNCSEL_M2nCE1       0x00000000
#define REG_GPIO_PADREGG_PAD24FNCSEL_M0nCE1       0x00000008
#define REG_GPIO_PADREGG_PAD24FNCSEL_CLKOUT       0x00000010
#define REG_GPIO_PADREGG_PAD24FNCSEL_GPIO24       0x00000018
#define REG_GPIO_PADREGG_PAD24FNCSEL_M5nCE0       0x00000020
#define REG_GPIO_PADREGG_PAD24FNCSEL_TCTA1        0x00000028
#define REG_GPIO_PADREGG_PAD24FNCSEL_I2S_BCLK     0x00000030
#define REG_GPIO_PADREGG_PAD24FNCSEL_SWO          0x00000038

// Pad 24 drive strength
#define REG_GPIO_PADREGG_PAD24STRNG_S             2
#define REG_GPIO_PADREGG_PAD24STRNG_M             0x00000004
#define REG_GPIO_PADREGG_PAD24STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGG_PAD24STRNG_LOW           0x00000000
#define REG_GPIO_PADREGG_PAD24STRNG_HIGH          0x00000004

// Pad 24 input enable
#define REG_GPIO_PADREGG_PAD24INPEN_S             1
#define REG_GPIO_PADREGG_PAD24INPEN_M             0x00000002
#define REG_GPIO_PADREGG_PAD24INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGG_PAD24INPEN_DIS           0x00000000
#define REG_GPIO_PADREGG_PAD24INPEN_EN            0x00000002

// Pad 24 pullup enable
#define REG_GPIO_PADREGG_PAD24PULL_S              0
#define REG_GPIO_PADREGG_PAD24PULL_M              0x00000001
#define REG_GPIO_PADREGG_PAD24PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGG_PAD24PULL_DIS            0x00000000
#define REG_GPIO_PADREGG_PAD24PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGH - Pad Configuration Register H
//
//*****************************************************************************
// Pad 31 function select
#define REG_GPIO_PADREGH_PAD31FNCSEL_S            27
#define REG_GPIO_PADREGH_PAD31FNCSEL_M            0x38000000
#define REG_GPIO_PADREGH_PAD31FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGH_PAD31FNCSEL_ADCSE3       0x00000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_M0nCE4       0x08000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_TCTA3        0x10000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_GPIO31       0x18000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_UART0RX      0x20000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_TCTB1        0x28000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_UNDEF6       0x30000000
#define REG_GPIO_PADREGH_PAD31FNCSEL_UNDEF7       0x38000000

// Pad 31 drive strength
#define REG_GPIO_PADREGH_PAD31STRNG_S             26
#define REG_GPIO_PADREGH_PAD31STRNG_M             0x04000000
#define REG_GPIO_PADREGH_PAD31STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGH_PAD31STRNG_LOW           0x00000000
#define REG_GPIO_PADREGH_PAD31STRNG_HIGH          0x04000000

