mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 31 input enable
#define REG_GPIO_PADREGH_PAD31INPEN_S             25
#define REG_GPIO_PADREGH_PAD31INPEN_M             0x02000000
#define REG_GPIO_PADREGH_PAD31INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGH_PAD31INPEN_DIS           0x00000000
#define REG_GPIO_PADREGH_PAD31INPEN_EN            0x02000000

// Pad 31 pullup enable
#define REG_GPIO_PADREGH_PAD31PULL_S              24
#define REG_GPIO_PADREGH_PAD31PULL_M              0x01000000
#define REG_GPIO_PADREGH_PAD31PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGH_PAD31PULL_DIS            0x00000000
#define REG_GPIO_PADREGH_PAD31PULL_EN             0x01000000

// Pad 30 function select
#define REG_GPIO_PADREGH_PAD30FNCSEL_S            19
#define REG_GPIO_PADREGH_PAD30FNCSEL_M            0x00380000
#define REG_GPIO_PADREGH_PAD30FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGH_PAD30FNCSEL_UNDEF0       0x00000000
#define REG_GPIO_PADREGH_PAD30FNCSEL_M1nCE7       0x00080000
#define REG_GPIO_PADREGH_PAD30FNCSEL_TCTB2        0x00100000
#define REG_GPIO_PADREGH_PAD30FNCSEL_GPIO30       0x00180000
#define REG_GPIO_PADREGH_PAD30FNCSEL_UART0TX      0x00200000
#define REG_GPIO_PADREGH_PAD30FNCSEL_UA1RTS       0x00280000
#define REG_GPIO_PADREGH_PAD30FNCSEL_UNDEF6       0x00300000
#define REG_GPIO_PADREGH_PAD30FNCSEL_I2S_DAT      0x00380000

// Pad 30 drive strength
#define REG_GPIO_PADREGH_PAD30STRNG_S             18
#define REG_GPIO_PADREGH_PAD30STRNG_M             0x00040000
#define REG_GPIO_PADREGH_PAD30STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGH_PAD30STRNG_LOW           0x00000000
#define REG_GPIO_PADREGH_PAD30STRNG_HIGH          0x00040000

// Pad 30 input enable
#define REG_GPIO_PADREGH_PAD30INPEN_S             17
#define REG_GPIO_PADREGH_PAD30INPEN_M             0x00020000
#define REG_GPIO_PADREGH_PAD30INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGH_PAD30INPEN_DIS           0x00000000
#define REG_GPIO_PADREGH_PAD30INPEN_EN            0x00020000

// Pad 30 pullup enable
#define REG_GPIO_PADREGH_PAD30PULL_S              16
#define REG_GPIO_PADREGH_PAD30PULL_M              0x00010000
#define REG_GPIO_PADREGH_PAD30PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGH_PAD30PULL_DIS            0x00000000
#define REG_GPIO_PADREGH_PAD30PULL_EN             0x00010000

// Pad 29 function select
#define REG_GPIO_PADREGH_PAD29FNCSEL_S            11
#define REG_GPIO_PADREGH_PAD29FNCSEL_M            0x00003800
#define REG_GPIO_PADREGH_PAD29FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGH_PAD29FNCSEL_ADCSE1       0x00000000
#define REG_GPIO_PADREGH_PAD29FNCSEL_M1nCE6       0x00000800
#define REG_GPIO_PADREGH_PAD29FNCSEL_TCTA2        0x00001000
#define REG_GPIO_PADREGH_PAD29FNCSEL_GPIO29       0x00001800
#define REG_GPIO_PADREGH_PAD29FNCSEL_UA0CTS       0x00002000
#define REG_GPIO_PADREGH_PAD29FNCSEL_UA1CTS       0x00002800
#define REG_GPIO_PADREGH_PAD29FNCSEL_M4nCE0       0x00003000
#define REG_GPIO_PADREGH_PAD29FNCSEL_PDM_DATA     0x00003800

// Pad 29 drive strength
#define REG_GPIO_PADREGH_PAD29STRNG_S             10
#define REG_GPIO_PADREGH_PAD29STRNG_M             0x00000400
#define REG_GPIO_PADREGH_PAD29STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGH_PAD29STRNG_LOW           0x00000000
#define REG_GPIO_PADREGH_PAD29STRNG_HIGH          0x00000400

// Pad 29 input enable
#define REG_GPIO_PADREGH_PAD29INPEN_S             9
#define REG_GPIO_PADREGH_PAD29INPEN_M             0x00000200
#define REG_GPIO_PADREGH_PAD29INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGH_PAD29INPEN_DIS           0x00000000
#define REG_GPIO_PADREGH_PAD29INPEN_EN            0x00000200

// Pad 29 pullup enable
#define REG_GPIO_PADREGH_PAD29PULL_S              8
#define REG_GPIO_PADREGH_PAD29PULL_M              0x00000100
#define REG_GPIO_PADREGH_PAD29PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGH_PAD29PULL_DIS            0x00000000
#define REG_GPIO_PADREGH_PAD29PULL_EN             0x00000100

// Pad 28 function select
#define REG_GPIO_PADREGH_PAD28FNCSEL_S            3
#define REG_GPIO_PADREGH_PAD28FNCSEL_M            0x00000038
#define REG_GPIO_PADREGH_PAD28FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGH_PAD28FNCSEL_I2S_WCLK     0x00000000
#define REG_GPIO_PADREGH_PAD28FNCSEL_M1nCE5       0x00000008
#define REG_GPIO_PADREGH_PAD28FNCSEL_TCTB1        0x00000010
#define REG_GPIO_PADREGH_PAD28FNCSEL_GPIO28       0x00000018
#define REG_GPIO_PADREGH_PAD28FNCSEL_M2WIR3       0x00000020
#define REG_GPIO_PADREGH_PAD28FNCSEL_M2MOSI       0x00000028
#define REG_GPIO_PADREGH_PAD28FNCSEL_M5nCE3       0x00000030
#define REG_GPIO_PADREGH_PAD28FNCSEL_SLWIR3LB     0x00000038

// Pad 28 drive strength
#define REG_GPIO_PADREGH_PAD28STRNG_S             2
#define REG_GPIO_PADREGH_PAD28STRNG_M             0x00000004
#define REG_GPIO_PADREGH_PAD28STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGH_PAD28STRNG_LOW           0x00000000
#define REG_GPIO_PADREGH_PAD28STRNG_HIGH          0x00000004

// Pad 28 input enable
#define REG_GPIO_PADREGH_PAD28INPEN_S             1
#define REG_GPIO_PADREGH_PAD28INPEN_M             0x00000002
#define REG_GPIO_PADREGH_PAD28INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGH_PAD28INPEN_DIS           0x00000000
#define REG_GPIO_PADREGH_PAD28INPEN_EN            0x00000002

// Pad 28 pullup enable
#define REG_GPIO_PADREGH_PAD28PULL_S              0
#define REG_GPIO_PADREGH_PAD28PULL_M              0x00000001
#define REG_GPIO_PADREGH_PAD28PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGH_PAD28PULL_DIS            0x00000000
#define REG_GPIO_PADREGH_PAD28PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGI - Pad Configuration Register I
//
//*****************************************************************************
// Pad 35 function select
#define REG_GPIO_PADREGI_PAD35FNCSEL_S            27
#define REG_GPIO_PADREGI_PAD35FNCSEL_M            0x38000000
#define REG_GPIO_PADREGI_PAD35FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGI_PAD35FNCSEL_ADCSE7       0x00000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_M1nCE0       0x08000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_UART1TX      0x10000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_GPIO35       0x18000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_M4nCE6       0x20000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_TCTA1        0x28000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_UA0RTS       0x30000000
#define REG_GPIO_PADREGI_PAD35FNCSEL_M3nCE2       0x38000000

// Pad 35 drive strength
#define REG_GPIO_PADREGI_PAD35STRNG_S             26
#define REG_GPIO_PADREGI_PAD35STRNG_M             0x04000000
#define REG_GPIO_PADREGI_PAD35STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGI_PAD35STRNG_LOW           0x00000000
#define REG_GPIO_PADREGI_PAD35STRNG_HIGH          0x04000000

// Pad 35 input enable
#define REG_GPIO_PADREGI_PAD35INPEN_S             25
#define REG_GPIO_PADREGI_PAD35INPEN_M             0x02000000
#define REG_GPIO_PADREGI_PAD35INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGI_PAD35INPEN_DIS           0x00000000
#define REG_GPIO_PADREGI_PAD35INPEN_EN            0x02000000

// Pad 35 pullup enable
#define REG_GPIO_PADREGI_PAD35PULL_S              24
#define REG_GPIO_PADREGI_PAD35PULL_M              0x01000000
#define REG_GPIO_PADREGI_PAD35PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGI_PAD35PULL_DIS            0x00000000
#define REG_GPIO_PADREGI_PAD35PULL_EN             0x01000000

// Pad 34 function select
#define REG_GPIO_PADREGI_PAD34FNCSEL_S            19
#define REG_GPIO_PADREGI_PAD34FNCSEL_M            0x00380000
#define REG_GPIO_PADREGI_PAD34FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGI_PAD34FNCSEL_ADCSE6       0x00000000
#define REG_GPIO_PADREGI_PAD34FNCSEL_M0nCE7       0x00080000
#define REG_GPIO_PADREGI_PAD34FNCSEL_M2nCE3       0x00100000
#define REG_GPIO_PADREGI_PAD34FNCSEL_GPIO34       0x00180000
#define REG_GPIO_PADREGI_PAD34FNCSEL_CMPRF2       0x00200000
#define REG_GPIO_PADREGI_PAD34FNCSEL_M3nCE1       0x00280000
#define REG_GPIO_PADREGI_PAD34FNCSEL_M4nCE0       0x00300000
#define REG_GPIO_PADREGI_PAD34FNCSEL_M5nCE2       0x00380000

// Pad 34 drive strength
#define REG_GPIO_PADREGI_PAD34STRNG_S             18
#define REG_GPIO_PADREGI_PAD34STRNG_M             0x00040000
#define REG_GPIO_PADREGI_PAD34STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGI_PAD34STRNG_LOW           0x00000000
#define REG_GPIO_PADREGI_PAD34STRNG_HIGH          0x00040000

// Pad 34 input enable
#define REG_GPIO_PADREGI_PAD34INPEN_S             17
#define REG_GPIO_PADREGI_PAD34INPEN_M             0x00020000
#define REG_GPIO_PADREGI_PAD34INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGI_PAD34INPEN_DIS           0x00000000
#define REG_GPIO_PADREGI_PAD34INPEN_EN            0x00020000

// Pad 34 pullup enable
#define REG_GPIO_PADREGI_PAD34PULL_S              16
#define REG_GPIO_PADREGI_PAD34PULL_M              0x00010000
#define REG_GPIO_PADREGI_PAD34PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGI_PAD34PULL_DIS            0x00000000
#define REG_GPIO_PADREGI_PAD34PULL_EN             0x00010000

// Pad 33 function select
#define REG_GPIO_PADREGI_PAD33FNCSEL_S            11
#define REG_GPIO_PADREGI_PAD33FNCSEL_M            0x00003800
#define REG_GPIO_PADREGI_PAD33FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGI_PAD33FNCSEL_ADCSE5       0x00000000
#define REG_GPIO_PADREGI_PAD33FNCSEL_M0nCE6       0x00000800
#define REG_GPIO_PADREGI_PAD33FNCSEL_32khz_XT     0x00001000
#define REG_GPIO_PADREGI_PAD33FNCSEL_GPIO33       0x00001800
#define REG_GPIO_PADREGI_PAD33FNCSEL_UNDEF4       0x00002000
#define REG_GPIO_PADREGI_PAD33FNCSEL_M3nCE7       0x00002800
#define REG_GPIO_PADREGI_PAD33FNCSEL_TCTB1        0x00003000
#define REG_GPIO_PADREGI_PAD33FNCSEL_SWO          0x00003800

// Pad 33 drive strength
#define REG_GPIO_PADREGI_PAD33STRNG_S             10
#define REG_GPIO_PADREGI_PAD33STRNG_M             0x00000400
#define REG_GPIO_PADREGI_PAD33STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGI_PAD33STRNG_LOW           0x00000000
#define REG_GPIO_PADREGI_PAD33STRNG_HIGH          0x00000400

// Pad 33 input enable
#define REG_GPIO_PADREGI_PAD33INPEN_S             9
#define REG_GPIO_PADREGI_PAD33INPEN_M             0x00000200
#define REG_GPIO_PADREGI_PAD33INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGI_PAD33INPEN_DIS           0x00000000
#define REG_GPIO_PADREGI_PAD33INPEN_EN            0x00000200

// Pad 33 pullup enable
#define REG_GPIO_PADREGI_PAD33PULL_S              8
#define REG_GPIO_PADREGI_PAD33PULL_M              0x00000100
#define REG_GPIO_PADREGI_PAD33PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGI_PAD33PULL_DIS            0x00000000
#define REG_GPIO_PADREGI_PAD33PULL_EN             0x00000100

// Pad 32 function select
#define REG_GPIO_PADREGI_PAD32FNCSEL_S            3
#define REG_GPIO_PADREGI_PAD32FNCSEL_M            0x00000038
#define REG_GPIO_PADREGI_PAD32FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGI_PAD32FNCSEL_ADCSE4       0x00000000
#define REG_GPIO_PADREGI_PAD32FNCSEL_M0nCE5       0x00000008
#define REG_GPIO_PADREGI_PAD32FNCSEL_TCTB3        0x00000010
#define REG_GPIO_PADREGI_PAD32FNCSEL_GPIO32       0x00000018
#define REG_GPIO_PADREGI_PAD32FNCSEL_UNDEF4       0x00000020
#define REG_GPIO_PADREGI_PAD32FNCSEL_TCTB1        0x00000028
#define REG_GPIO_PADREGI_PAD32FNCSEL_UNDEF6       0x00000030
#define REG_GPIO_PADREGI_PAD32FNCSEL_UNDEF7       0x00000038

// Pad 32 drive strength
#define REG_GPIO_PADREGI_PAD32STRNG_S             2
#define REG_GPIO_PADREGI_PAD32STRNG_M             0x00000004
#define REG_GPIO_PADREGI_PAD32STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGI_PAD32STRNG_LOW           0x00000000
#define REG_GPIO_PADREGI_PAD32STRNG_HIGH          0x00000004

// Pad 32 input enable
#define REG_GPIO_PADREGI_PAD32INPEN_S             1
#define REG_GPIO_PADREGI_PAD32INPEN_M             0x00000002
#define REG_GPIO_PADREGI_PAD32INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGI_PAD32INPEN_DIS           0x00000000
#define REG_GPIO_PADREGI_PAD32INPEN_EN            0x00000002

// Pad 32 pullup enable
#define REG_GPIO_PADREGI_PAD32PULL_S              0
#define REG_GPIO_PADREGI_PAD32PULL_M              0x00000001
#define REG_GPIO_PADREGI_PAD32PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGI_PAD32PULL_DIS            0x00000000
#define REG_GPIO_PADREGI_PAD32PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGJ - Pad Configuration Register J
//
//*****************************************************************************
// Pad 39 pullup resistor selection.
#define REG_GPIO_PADREGJ_PAD39RSEL_S              30
#define REG_GPIO_PADREGJ_PAD39RSEL_M              0xC0000000
#define REG_GPIO_PADREGJ_PAD39RSEL(n)             (((uint32_t)(n) << 30) & 0xC0000000)
#define REG_GPIO_PADREGJ_PAD39RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGJ_PAD39RSEL_PULL6K         0x40000000
#define REG_GPIO_PADREGJ_PAD39RSEL_PULL12K        0x80000000
#define REG_GPIO_PADREGJ_PAD39RSEL_PULL24K        0xC0000000

