mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 39 function select
#define REG_GPIO_PADREGJ_PAD39FNCSEL_S            27
#define REG_GPIO_PADREGJ_PAD39FNCSEL_M            0x38000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGJ_PAD39FNCSEL_UART0TX      0x00000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_UART1TX      0x08000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_CLKOUT       0x10000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_GPIO39       0x18000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_M4SCL        0x20000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_M4SCK        0x28000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_M4SCKLB      0x30000000
#define REG_GPIO_PADREGJ_PAD39FNCSEL_M4SCLLB      0x38000000

// Pad 39 drive strength
#define REG_GPIO_PADREGJ_PAD39STRNG_S             26
#define REG_GPIO_PADREGJ_PAD39STRNG_M             0x04000000
#define REG_GPIO_PADREGJ_PAD39STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGJ_PAD39STRNG_LOW           0x00000000
#define REG_GPIO_PADREGJ_PAD39STRNG_HIGH          0x04000000

// Pad 39 input enable
#define REG_GPIO_PADREGJ_PAD39INPEN_S             25
#define REG_GPIO_PADREGJ_PAD39INPEN_M             0x02000000
#define REG_GPIO_PADREGJ_PAD39INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGJ_PAD39INPEN_DIS           0x00000000
#define REG_GPIO_PADREGJ_PAD39INPEN_EN            0x02000000

// Pad 39 pullup enable
#define REG_GPIO_PADREGJ_PAD39PULL_S              24
#define REG_GPIO_PADREGJ_PAD39PULL_M              0x01000000
#define REG_GPIO_PADREGJ_PAD39PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGJ_PAD39PULL_DIS            0x00000000
#define REG_GPIO_PADREGJ_PAD39PULL_EN             0x01000000

// Pad 38 function select
#define REG_GPIO_PADREGJ_PAD38FNCSEL_S            19
#define REG_GPIO_PADREGJ_PAD38FNCSEL_M            0x00380000
#define REG_GPIO_PADREGJ_PAD38FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGJ_PAD38FNCSEL_TRIG3        0x00000000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_M1nCE3       0x00080000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_UA0CTS       0x00100000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_GPIO38       0x00180000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_M3WIR3       0x00200000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_M3MOSI       0x00280000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_M4nCE7       0x00300000
#define REG_GPIO_PADREGJ_PAD38FNCSEL_SLWIR3LB     0x00380000

// Pad 38 drive strength
#define REG_GPIO_PADREGJ_PAD38STRNG_S             18
#define REG_GPIO_PADREGJ_PAD38STRNG_M             0x00040000
#define REG_GPIO_PADREGJ_PAD38STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGJ_PAD38STRNG_LOW           0x00000000
#define REG_GPIO_PADREGJ_PAD38STRNG_HIGH          0x00040000

// Pad 38 input enable
#define REG_GPIO_PADREGJ_PAD38INPEN_S             17
#define REG_GPIO_PADREGJ_PAD38INPEN_M             0x00020000
#define REG_GPIO_PADREGJ_PAD38INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGJ_PAD38INPEN_DIS           0x00000000
#define REG_GPIO_PADREGJ_PAD38INPEN_EN            0x00020000

// Pad 38 pullup enable
#define REG_GPIO_PADREGJ_PAD38PULL_S              16
#define REG_GPIO_PADREGJ_PAD38PULL_M              0x00010000
#define REG_GPIO_PADREGJ_PAD38PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGJ_PAD38PULL_DIS            0x00000000
#define REG_GPIO_PADREGJ_PAD38PULL_EN             0x00010000

// Pad 37 function select
#define REG_GPIO_PADREGJ_PAD37FNCSEL_S            11
#define REG_GPIO_PADREGJ_PAD37FNCSEL_M            0x00003800
#define REG_GPIO_PADREGJ_PAD37FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGJ_PAD37FNCSEL_TRIG2        0x00000000
#define REG_GPIO_PADREGJ_PAD37FNCSEL_M1nCE2       0x00000800
#define REG_GPIO_PADREGJ_PAD37FNCSEL_UA0RTS       0x00001000
#define REG_GPIO_PADREGJ_PAD37FNCSEL_GPIO37       0x00001800
#define REG_GPIO_PADREGJ_PAD37FNCSEL_M3nCE4       0x00002000
#define REG_GPIO_PADREGJ_PAD37FNCSEL_M4nCE1       0x00002800
#define REG_GPIO_PADREGJ_PAD37FNCSEL_PDM_CLK      0x00003000
#define REG_GPIO_PADREGJ_PAD37FNCSEL_TCTA1        0x00003800

// Pad 37 drive strength
#define REG_GPIO_PADREGJ_PAD37STRNG_S             10
#define REG_GPIO_PADREGJ_PAD37STRNG_M             0x00000400
#define REG_GPIO_PADREGJ_PAD37STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGJ_PAD37STRNG_LOW           0x00000000
#define REG_GPIO_PADREGJ_PAD37STRNG_HIGH          0x00000400

// Pad 37 input enable
#define REG_GPIO_PADREGJ_PAD37INPEN_S             9
#define REG_GPIO_PADREGJ_PAD37INPEN_M             0x00000200
#define REG_GPIO_PADREGJ_PAD37INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGJ_PAD37INPEN_DIS           0x00000000
#define REG_GPIO_PADREGJ_PAD37INPEN_EN            0x00000200

// Pad 37 pullup enable
#define REG_GPIO_PADREGJ_PAD37PULL_S              8
#define REG_GPIO_PADREGJ_PAD37PULL_M              0x00000100
#define REG_GPIO_PADREGJ_PAD37PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGJ_PAD37PULL_DIS            0x00000000
#define REG_GPIO_PADREGJ_PAD37PULL_EN             0x00000100

// Pad 36 function select
#define REG_GPIO_PADREGJ_PAD36FNCSEL_S            3
#define REG_GPIO_PADREGJ_PAD36FNCSEL_M            0x00000038
#define REG_GPIO_PADREGJ_PAD36FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGJ_PAD36FNCSEL_TRIG1        0x00000000
#define REG_GPIO_PADREGJ_PAD36FNCSEL_M1nCE1       0x00000008
#define REG_GPIO_PADREGJ_PAD36FNCSEL_UART1RX      0x00000010
#define REG_GPIO_PADREGJ_PAD36FNCSEL_GPIO36       0x00000018
#define REG_GPIO_PADREGJ_PAD36FNCSEL_32khz_XT     0x00000020
#define REG_GPIO_PADREGJ_PAD36FNCSEL_M2nCE0       0x00000028
#define REG_GPIO_PADREGJ_PAD36FNCSEL_UA0CTS       0x00000030
#define REG_GPIO_PADREGJ_PAD36FNCSEL_M3nCE3       0x00000038

// Pad 36 drive strength
#define REG_GPIO_PADREGJ_PAD36STRNG_S             2
#define REG_GPIO_PADREGJ_PAD36STRNG_M             0x00000004
#define REG_GPIO_PADREGJ_PAD36STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGJ_PAD36STRNG_LOW           0x00000000
#define REG_GPIO_PADREGJ_PAD36STRNG_HIGH          0x00000004

