mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 36 input enable
#define REG_GPIO_PADREGJ_PAD36INPEN_S             1
#define REG_GPIO_PADREGJ_PAD36INPEN_M             0x00000002
#define REG_GPIO_PADREGJ_PAD36INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGJ_PAD36INPEN_DIS           0x00000000
#define REG_GPIO_PADREGJ_PAD36INPEN_EN            0x00000002

// Pad 36 pullup enable
#define REG_GPIO_PADREGJ_PAD36PULL_S              0
#define REG_GPIO_PADREGJ_PAD36PULL_M              0x00000001
#define REG_GPIO_PADREGJ_PAD36PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGJ_PAD36PULL_DIS            0x00000000
#define REG_GPIO_PADREGJ_PAD36PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGK - Pad Configuration Register K
//
//*****************************************************************************
// Pad 43 pullup resistor selection.
#define REG_GPIO_PADREGK_PAD43RSEL_S              30
#define REG_GPIO_PADREGK_PAD43RSEL_M              0xC0000000
#define REG_GPIO_PADREGK_PAD43RSEL(n)             (((uint32_t)(n) << 30) & 0xC0000000)
#define REG_GPIO_PADREGK_PAD43RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGK_PAD43RSEL_PULL6K         0x40000000
#define REG_GPIO_PADREGK_PAD43RSEL_PULL12K        0x80000000
#define REG_GPIO_PADREGK_PAD43RSEL_PULL24K        0xC0000000

// Pad 43 function select
#define REG_GPIO_PADREGK_PAD43FNCSEL_S            27
#define REG_GPIO_PADREGK_PAD43FNCSEL_M            0x38000000
#define REG_GPIO_PADREGK_PAD43FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGK_PAD43FNCSEL_M2nCE4       0x00000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_M0nCE1       0x08000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_TCTB0        0x10000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_GPIO43       0x18000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_M3SDA        0x20000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_M3MISO       0x28000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_SLMISOLB     0x30000000
#define REG_GPIO_PADREGK_PAD43FNCSEL_SLSDALB      0x38000000

// Pad 43 drive strength
#define REG_GPIO_PADREGK_PAD43STRNG_S             26
#define REG_GPIO_PADREGK_PAD43STRNG_M             0x04000000
#define REG_GPIO_PADREGK_PAD43STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGK_PAD43STRNG_LOW           0x00000000
#define REG_GPIO_PADREGK_PAD43STRNG_HIGH          0x04000000

// Pad 43 input enable
#define REG_GPIO_PADREGK_PAD43INPEN_S             25
#define REG_GPIO_PADREGK_PAD43INPEN_M             0x02000000
#define REG_GPIO_PADREGK_PAD43INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGK_PAD43INPEN_DIS           0x00000000
#define REG_GPIO_PADREGK_PAD43INPEN_EN            0x02000000

// Pad 43 pullup enable
#define REG_GPIO_PADREGK_PAD43PULL_S              24
#define REG_GPIO_PADREGK_PAD43PULL_M              0x01000000
#define REG_GPIO_PADREGK_PAD43PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGK_PAD43PULL_DIS            0x00000000
#define REG_GPIO_PADREGK_PAD43PULL_EN             0x01000000

// Pad 42 pullup resistor selection.
#define REG_GPIO_PADREGK_PAD42RSEL_S              22
#define REG_GPIO_PADREGK_PAD42RSEL_M              0x00C00000
#define REG_GPIO_PADREGK_PAD42RSEL(n)             (((uint32_t)(n) << 22) & 0x00C00000)
#define REG_GPIO_PADREGK_PAD42RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGK_PAD42RSEL_PULL6K         0x00400000
#define REG_GPIO_PADREGK_PAD42RSEL_PULL12K        0x00800000
#define REG_GPIO_PADREGK_PAD42RSEL_PULL24K        0x00C00000

// Pad 42 function select
#define REG_GPIO_PADREGK_PAD42FNCSEL_S            19
#define REG_GPIO_PADREGK_PAD42FNCSEL_M            0x00380000
#define REG_GPIO_PADREGK_PAD42FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGK_PAD42FNCSEL_M2nCE2       0x00000000
#define REG_GPIO_PADREGK_PAD42FNCSEL_M0nCE0       0x00080000
#define REG_GPIO_PADREGK_PAD42FNCSEL_TCTA0        0x00100000
#define REG_GPIO_PADREGK_PAD42FNCSEL_GPIO42       0x00180000
#define REG_GPIO_PADREGK_PAD42FNCSEL_M3SCL        0x00200000
#define REG_GPIO_PADREGK_PAD42FNCSEL_M3SCK        0x00280000
#define REG_GPIO_PADREGK_PAD42FNCSEL_M3SCKLB      0x00300000
#define REG_GPIO_PADREGK_PAD42FNCSEL_M3SCLLB      0x00380000

// Pad 42 drive strength
#define REG_GPIO_PADREGK_PAD42STRNG_S             18
#define REG_GPIO_PADREGK_PAD42STRNG_M             0x00040000
#define REG_GPIO_PADREGK_PAD42STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGK_PAD42STRNG_LOW           0x00000000
#define REG_GPIO_PADREGK_PAD42STRNG_HIGH          0x00040000

// Pad 42 input enable
#define REG_GPIO_PADREGK_PAD42INPEN_S             17
#define REG_GPIO_PADREGK_PAD42INPEN_M             0x00020000
#define REG_GPIO_PADREGK_PAD42INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGK_PAD42INPEN_DIS           0x00000000
#define REG_GPIO_PADREGK_PAD42INPEN_EN            0x00020000

// Pad 42 pullup enable
#define REG_GPIO_PADREGK_PAD42PULL_S              16
#define REG_GPIO_PADREGK_PAD42PULL_M              0x00010000
#define REG_GPIO_PADREGK_PAD42PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGK_PAD42PULL_DIS            0x00000000
#define REG_GPIO_PADREGK_PAD42PULL_EN             0x00010000

// Pad 41 upper power switch enable
#define REG_GPIO_PADREGK_PAD41PWRUP_S             15
#define REG_GPIO_PADREGK_PAD41PWRUP_M             0x00008000
#define REG_GPIO_PADREGK_PAD41PWRUP(n)            (((uint32_t)(n) << 15) & 0x00008000)
#define REG_GPIO_PADREGK_PAD41PWRUP_DIS           0x00000000
#define REG_GPIO_PADREGK_PAD41PWRUP_EN            0x00008000

// Pad 41 function select
#define REG_GPIO_PADREGK_PAD41FNCSEL_S            11
#define REG_GPIO_PADREGK_PAD41FNCSEL_M            0x00003800
#define REG_GPIO_PADREGK_PAD41FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGK_PAD41FNCSEL_M2nCE1       0x00000000
#define REG_GPIO_PADREGK_PAD41FNCSEL_CLKOUT       0x00000800
#define REG_GPIO_PADREGK_PAD41FNCSEL_SWO          0x00001000
#define REG_GPIO_PADREGK_PAD41FNCSEL_GPIO41       0x00001800
#define REG_GPIO_PADREGK_PAD41FNCSEL_M3nCE5       0x00002000
#define REG_GPIO_PADREGK_PAD41FNCSEL_M5nCE7       0x00002800
#define REG_GPIO_PADREGK_PAD41FNCSEL_M4nCE2       0x00003000
#define REG_GPIO_PADREGK_PAD41FNCSEL_UA0RTS       0x00003800

// Pad 41 drive strength
#define REG_GPIO_PADREGK_PAD41STRNG_S             10
#define REG_GPIO_PADREGK_PAD41STRNG_M             0x00000400
#define REG_GPIO_PADREGK_PAD41STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGK_PAD41STRNG_LOW           0x00000000
#define REG_GPIO_PADREGK_PAD41STRNG_HIGH          0x00000400

// Pad 41 input enable
#define REG_GPIO_PADREGK_PAD41INPEN_S             9
#define REG_GPIO_PADREGK_PAD41INPEN_M             0x00000200
#define REG_GPIO_PADREGK_PAD41INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGK_PAD41INPEN_DIS           0x00000000
#define REG_GPIO_PADREGK_PAD41INPEN_EN            0x00000200

// Pad 41 pullup enable
#define REG_GPIO_PADREGK_PAD41PULL_S              8
#define REG_GPIO_PADREGK_PAD41PULL_M              0x00000100
#define REG_GPIO_PADREGK_PAD41PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGK_PAD41PULL_DIS            0x00000000
#define REG_GPIO_PADREGK_PAD41PULL_EN             0x00000100

// Pad 40 pullup resistor selection.
#define REG_GPIO_PADREGK_PAD40RSEL_S              6
#define REG_GPIO_PADREGK_PAD40RSEL_M              0x000000C0
#define REG_GPIO_PADREGK_PAD40RSEL(n)             (((uint32_t)(n) << 6) & 0x000000C0)
#define REG_GPIO_PADREGK_PAD40RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGK_PAD40RSEL_PULL6K         0x00000040
#define REG_GPIO_PADREGK_PAD40RSEL_PULL12K        0x00000080
#define REG_GPIO_PADREGK_PAD40RSEL_PULL24K        0x000000C0

// Pad 40 function select
#define REG_GPIO_PADREGK_PAD40FNCSEL_S            3
#define REG_GPIO_PADREGK_PAD40FNCSEL_M            0x00000038
#define REG_GPIO_PADREGK_PAD40FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGK_PAD40FNCSEL_UART0RX      0x00000000
#define REG_GPIO_PADREGK_PAD40FNCSEL_UART1RX      0x00000008
#define REG_GPIO_PADREGK_PAD40FNCSEL_TRIG0        0x00000010
#define REG_GPIO_PADREGK_PAD40FNCSEL_GPIO40       0x00000018
#define REG_GPIO_PADREGK_PAD40FNCSEL_M4SDA        0x00000020
#define REG_GPIO_PADREGK_PAD40FNCSEL_M4MISO       0x00000028
#define REG_GPIO_PADREGK_PAD40FNCSEL_SLMISOLB     0x00000030
#define REG_GPIO_PADREGK_PAD40FNCSEL_SLSDALB      0x00000038

// Pad 40 drive strength
#define REG_GPIO_PADREGK_PAD40STRNG_S             2
#define REG_GPIO_PADREGK_PAD40STRNG_M             0x00000004
#define REG_GPIO_PADREGK_PAD40STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGK_PAD40STRNG_LOW           0x00000000
#define REG_GPIO_PADREGK_PAD40STRNG_HIGH          0x00000004

