mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 40 input enable
#define REG_GPIO_PADREGK_PAD40INPEN_S             1
#define REG_GPIO_PADREGK_PAD40INPEN_M             0x00000002
#define REG_GPIO_PADREGK_PAD40INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGK_PAD40INPEN_DIS           0x00000000
#define REG_GPIO_PADREGK_PAD40INPEN_EN            0x00000002

// Pad 40 pullup enable
#define REG_GPIO_PADREGK_PAD40PULL_S              0
#define REG_GPIO_PADREGK_PAD40PULL_M              0x00000001
#define REG_GPIO_PADREGK_PAD40PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGK_PAD40PULL_DIS            0x00000000
#define REG_GPIO_PADREGK_PAD40PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGL - Pad Configuration Register L
//
//*****************************************************************************
// Pad 47 function select
#define REG_GPIO_PADREGL_PAD47FNCSEL_S            27
#define REG_GPIO_PADREGL_PAD47FNCSEL_M            0x38000000
#define REG_GPIO_PADREGL_PAD47FNCSEL(n)           (((uint32_t)(n) << 27) & 0x38000000)
#define REG_GPIO_PADREGL_PAD47FNCSEL_M2nCE5       0x00000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_M0nCE5       0x08000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_TCTB2        0x10000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_GPIO47       0x18000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_M5WIR3       0x20000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_M5MOSI       0x28000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_M4nCE5       0x30000000
#define REG_GPIO_PADREGL_PAD47FNCSEL_SLWIR3LB     0x38000000

// Pad 47 drive strength
#define REG_GPIO_PADREGL_PAD47STRNG_S             26
#define REG_GPIO_PADREGL_PAD47STRNG_M             0x04000000
#define REG_GPIO_PADREGL_PAD47STRNG(n)            (((uint32_t)(n) << 26) & 0x04000000)
#define REG_GPIO_PADREGL_PAD47STRNG_LOW           0x00000000
#define REG_GPIO_PADREGL_PAD47STRNG_HIGH          0x04000000

// Pad 47 input enable
#define REG_GPIO_PADREGL_PAD47INPEN_S             25
#define REG_GPIO_PADREGL_PAD47INPEN_M             0x02000000
#define REG_GPIO_PADREGL_PAD47INPEN(n)            (((uint32_t)(n) << 25) & 0x02000000)
#define REG_GPIO_PADREGL_PAD47INPEN_DIS           0x00000000
#define REG_GPIO_PADREGL_PAD47INPEN_EN            0x02000000

// Pad 47 pullup enable
#define REG_GPIO_PADREGL_PAD47PULL_S              24
#define REG_GPIO_PADREGL_PAD47PULL_M              0x01000000
#define REG_GPIO_PADREGL_PAD47PULL(n)             (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_PADREGL_PAD47PULL_DIS            0x00000000
#define REG_GPIO_PADREGL_PAD47PULL_EN             0x01000000

// Pad 46 function select
#define REG_GPIO_PADREGL_PAD46FNCSEL_S            19
#define REG_GPIO_PADREGL_PAD46FNCSEL_M            0x00380000
#define REG_GPIO_PADREGL_PAD46FNCSEL(n)           (((uint32_t)(n) << 19) & 0x00380000)
#define REG_GPIO_PADREGL_PAD46FNCSEL_32khz_XT     0x00000000
#define REG_GPIO_PADREGL_PAD46FNCSEL_M0nCE4       0x00080000
#define REG_GPIO_PADREGL_PAD46FNCSEL_TCTA2        0x00100000
#define REG_GPIO_PADREGL_PAD46FNCSEL_GPIO46       0x00180000
#define REG_GPIO_PADREGL_PAD46FNCSEL_TCTA1        0x00200000
#define REG_GPIO_PADREGL_PAD46FNCSEL_M5nCE4       0x00280000
#define REG_GPIO_PADREGL_PAD46FNCSEL_M4nCE4       0x00300000
#define REG_GPIO_PADREGL_PAD46FNCSEL_SWO          0x00380000

// Pad 46 drive strength
#define REG_GPIO_PADREGL_PAD46STRNG_S             18
#define REG_GPIO_PADREGL_PAD46STRNG_M             0x00040000
#define REG_GPIO_PADREGL_PAD46STRNG(n)            (((uint32_t)(n) << 18) & 0x00040000)
#define REG_GPIO_PADREGL_PAD46STRNG_LOW           0x00000000
#define REG_GPIO_PADREGL_PAD46STRNG_HIGH          0x00040000

// Pad 46 input enable
#define REG_GPIO_PADREGL_PAD46INPEN_S             17
#define REG_GPIO_PADREGL_PAD46INPEN_M             0x00020000
#define REG_GPIO_PADREGL_PAD46INPEN(n)            (((uint32_t)(n) << 17) & 0x00020000)
#define REG_GPIO_PADREGL_PAD46INPEN_DIS           0x00000000
#define REG_GPIO_PADREGL_PAD46INPEN_EN            0x00020000

// Pad 46 pullup enable
#define REG_GPIO_PADREGL_PAD46PULL_S              16
#define REG_GPIO_PADREGL_PAD46PULL_M              0x00010000
#define REG_GPIO_PADREGL_PAD46PULL(n)             (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_PADREGL_PAD46PULL_DIS            0x00000000
#define REG_GPIO_PADREGL_PAD46PULL_EN             0x00010000

// Pad 45 function select
#define REG_GPIO_PADREGL_PAD45FNCSEL_S            11
#define REG_GPIO_PADREGL_PAD45FNCSEL_M            0x00003800
#define REG_GPIO_PADREGL_PAD45FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGL_PAD45FNCSEL_UA1CTS       0x00000000
#define REG_GPIO_PADREGL_PAD45FNCSEL_M0nCE3       0x00000800
#define REG_GPIO_PADREGL_PAD45FNCSEL_TCTB1        0x00001000
#define REG_GPIO_PADREGL_PAD45FNCSEL_GPIO45       0x00001800
#define REG_GPIO_PADREGL_PAD45FNCSEL_M4nCE3       0x00002000
#define REG_GPIO_PADREGL_PAD45FNCSEL_M3nCE6       0x00002800
#define REG_GPIO_PADREGL_PAD45FNCSEL_M5nCE5       0x00003000
#define REG_GPIO_PADREGL_PAD45FNCSEL_TCTA1        0x00003800

// Pad 45 drive strength
#define REG_GPIO_PADREGL_PAD45STRNG_S             10
#define REG_GPIO_PADREGL_PAD45STRNG_M             0x00000400
#define REG_GPIO_PADREGL_PAD45STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGL_PAD45STRNG_LOW           0x00000000
#define REG_GPIO_PADREGL_PAD45STRNG_HIGH          0x00000400

// Pad 45 input enable
#define REG_GPIO_PADREGL_PAD45INPEN_S             9
#define REG_GPIO_PADREGL_PAD45INPEN_M             0x00000200
#define REG_GPIO_PADREGL_PAD45INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGL_PAD45INPEN_DIS           0x00000000
#define REG_GPIO_PADREGL_PAD45INPEN_EN            0x00000200

// Pad 45 pullup enable
#define REG_GPIO_PADREGL_PAD45PULL_S              8
#define REG_GPIO_PADREGL_PAD45PULL_M              0x00000100
#define REG_GPIO_PADREGL_PAD45PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGL_PAD45PULL_DIS            0x00000000
#define REG_GPIO_PADREGL_PAD45PULL_EN             0x00000100

// Pad 44 function select
#define REG_GPIO_PADREGL_PAD44FNCSEL_S            3
#define REG_GPIO_PADREGL_PAD44FNCSEL_M            0x00000038
#define REG_GPIO_PADREGL_PAD44FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGL_PAD44FNCSEL_UA1RTS       0x00000000
#define REG_GPIO_PADREGL_PAD44FNCSEL_M0nCE2       0x00000008
#define REG_GPIO_PADREGL_PAD44FNCSEL_TCTA1        0x00000010
#define REG_GPIO_PADREGL_PAD44FNCSEL_GPIO44       0x00000018
#define REG_GPIO_PADREGL_PAD44FNCSEL_M4WIR3       0x00000020
#define REG_GPIO_PADREGL_PAD44FNCSEL_M4MOSI       0x00000028
#define REG_GPIO_PADREGL_PAD44FNCSEL_M5nCE6       0x00000030
#define REG_GPIO_PADREGL_PAD44FNCSEL_SLWIR3LB     0x00000038

