mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 44 drive strength
#define REG_GPIO_PADREGL_PAD44STRNG_S             2
#define REG_GPIO_PADREGL_PAD44STRNG_M             0x00000004
#define REG_GPIO_PADREGL_PAD44STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGL_PAD44STRNG_LOW           0x00000000
#define REG_GPIO_PADREGL_PAD44STRNG_HIGH          0x00000004

// Pad 44 input enable
#define REG_GPIO_PADREGL_PAD44INPEN_S             1
#define REG_GPIO_PADREGL_PAD44INPEN_M             0x00000002
#define REG_GPIO_PADREGL_PAD44INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGL_PAD44INPEN_DIS           0x00000000
#define REG_GPIO_PADREGL_PAD44INPEN_EN            0x00000002

// Pad 44 pullup enable
#define REG_GPIO_PADREGL_PAD44PULL_S              0
#define REG_GPIO_PADREGL_PAD44PULL_M              0x00000001
#define REG_GPIO_PADREGL_PAD44PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGL_PAD44PULL_DIS            0x00000000
#define REG_GPIO_PADREGL_PAD44PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_PADREGM - Pad Configuration Register M
//
//*****************************************************************************
// Pad 49 pullup resistor selection.
#define REG_GPIO_PADREGM_PAD49RSEL_S              14
#define REG_GPIO_PADREGM_PAD49RSEL_M              0x0000C000
#define REG_GPIO_PADREGM_PAD49RSEL(n)             (((uint32_t)(n) << 14) & 0x0000C000)
#define REG_GPIO_PADREGM_PAD49RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGM_PAD49RSEL_PULL6K         0x00004000
#define REG_GPIO_PADREGM_PAD49RSEL_PULL12K        0x00008000
#define REG_GPIO_PADREGM_PAD49RSEL_PULL24K        0x0000C000

// Pad 49 function select
#define REG_GPIO_PADREGM_PAD49FNCSEL_S            11
#define REG_GPIO_PADREGM_PAD49FNCSEL_M            0x00003800
#define REG_GPIO_PADREGM_PAD49FNCSEL(n)           (((uint32_t)(n) << 11) & 0x00003800)
#define REG_GPIO_PADREGM_PAD49FNCSEL_M2nCE7       0x00000000
#define REG_GPIO_PADREGM_PAD49FNCSEL_M0nCE7       0x00000800
#define REG_GPIO_PADREGM_PAD49FNCSEL_TCTB3        0x00001000
#define REG_GPIO_PADREGM_PAD49FNCSEL_GPIO49       0x00001800
#define REG_GPIO_PADREGM_PAD49FNCSEL_M5SDA        0x00002000
#define REG_GPIO_PADREGM_PAD49FNCSEL_M5MISO       0x00002800
#define REG_GPIO_PADREGM_PAD49FNCSEL_SLMISOLB     0x00003000
#define REG_GPIO_PADREGM_PAD49FNCSEL_SLSDALB      0x00003800

// Pad 49 drive strength
#define REG_GPIO_PADREGM_PAD49STRNG_S             10
#define REG_GPIO_PADREGM_PAD49STRNG_M             0x00000400
#define REG_GPIO_PADREGM_PAD49STRNG(n)            (((uint32_t)(n) << 10) & 0x00000400)
#define REG_GPIO_PADREGM_PAD49STRNG_LOW           0x00000000
#define REG_GPIO_PADREGM_PAD49STRNG_HIGH          0x00000400

// Pad 49 input enable
#define REG_GPIO_PADREGM_PAD49INPEN_S             9
#define REG_GPIO_PADREGM_PAD49INPEN_M             0x00000200
#define REG_GPIO_PADREGM_PAD49INPEN(n)            (((uint32_t)(n) << 9) & 0x00000200)
#define REG_GPIO_PADREGM_PAD49INPEN_DIS           0x00000000
#define REG_GPIO_PADREGM_PAD49INPEN_EN            0x00000200

// Pad 49 pullup enable
#define REG_GPIO_PADREGM_PAD49PULL_S              8
#define REG_GPIO_PADREGM_PAD49PULL_M              0x00000100
#define REG_GPIO_PADREGM_PAD49PULL(n)             (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_PADREGM_PAD49PULL_DIS            0x00000000
#define REG_GPIO_PADREGM_PAD49PULL_EN             0x00000100

// Pad 48 pullup resistor selection.
#define REG_GPIO_PADREGM_PAD48RSEL_S              6
#define REG_GPIO_PADREGM_PAD48RSEL_M              0x000000C0
#define REG_GPIO_PADREGM_PAD48RSEL(n)             (((uint32_t)(n) << 6) & 0x000000C0)
#define REG_GPIO_PADREGM_PAD48RSEL_PULL1_5K       0x00000000
#define REG_GPIO_PADREGM_PAD48RSEL_PULL6K         0x00000040
#define REG_GPIO_PADREGM_PAD48RSEL_PULL12K        0x00000080
#define REG_GPIO_PADREGM_PAD48RSEL_PULL24K        0x000000C0

// Pad 48 function select
#define REG_GPIO_PADREGM_PAD48FNCSEL_S            3
#define REG_GPIO_PADREGM_PAD48FNCSEL_M            0x00000038
#define REG_GPIO_PADREGM_PAD48FNCSEL(n)           (((uint32_t)(n) << 3) & 0x00000038)
#define REG_GPIO_PADREGM_PAD48FNCSEL_M2nCE6       0x00000000
#define REG_GPIO_PADREGM_PAD48FNCSEL_M0nCE6       0x00000008
#define REG_GPIO_PADREGM_PAD48FNCSEL_TCTA3        0x00000010
#define REG_GPIO_PADREGM_PAD48FNCSEL_GPIO48       0x00000018
#define REG_GPIO_PADREGM_PAD48FNCSEL_M5SCL        0x00000020
#define REG_GPIO_PADREGM_PAD48FNCSEL_M5SCK        0x00000028
#define REG_GPIO_PADREGM_PAD48FNCSEL_M5SCKLB      0x00000030
#define REG_GPIO_PADREGM_PAD48FNCSEL_M5SCLLB      0x00000038

// Pad 48 drive strength
#define REG_GPIO_PADREGM_PAD48STRNG_S             2
#define REG_GPIO_PADREGM_PAD48STRNG_M             0x00000004
#define REG_GPIO_PADREGM_PAD48STRNG(n)            (((uint32_t)(n) << 2) & 0x00000004)
#define REG_GPIO_PADREGM_PAD48STRNG_LOW           0x00000000
#define REG_GPIO_PADREGM_PAD48STRNG_HIGH          0x00000004

// Pad 48 input enable
#define REG_GPIO_PADREGM_PAD48INPEN_S             1
#define REG_GPIO_PADREGM_PAD48INPEN_M             0x00000002
#define REG_GPIO_PADREGM_PAD48INPEN(n)            (((uint32_t)(n) << 1) & 0x00000002)
#define REG_GPIO_PADREGM_PAD48INPEN_DIS           0x00000000
#define REG_GPIO_PADREGM_PAD48INPEN_EN            0x00000002

// Pad 48 pullup enable
#define REG_GPIO_PADREGM_PAD48PULL_S              0
#define REG_GPIO_PADREGM_PAD48PULL_M              0x00000001
#define REG_GPIO_PADREGM_PAD48PULL(n)             (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_PADREGM_PAD48PULL_DIS            0x00000000
#define REG_GPIO_PADREGM_PAD48PULL_EN             0x00000001

//*****************************************************************************
//
// GPIO_CFGA - GPIO Configuration Register A
//
//*****************************************************************************
// GPIO7 interrupt direction.
#define REG_GPIO_CFGA_GPIO7INTD_S                 31
#define REG_GPIO_CFGA_GPIO7INTD_M                 0x80000000
#define REG_GPIO_CFGA_GPIO7INTD(n)                (((uint32_t)(n) << 31) & 0x80000000)
#define REG_GPIO_CFGA_GPIO7INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO7INTD_INTHL             0x80000000

// GPIO7 output configuration.
#define REG_GPIO_CFGA_GPIO7OUTCFG_S               29
#define REG_GPIO_CFGA_GPIO7OUTCFG_M               0x60000000
#define REG_GPIO_CFGA_GPIO7OUTCFG(n)              (((uint32_t)(n) << 29) & 0x60000000)
#define REG_GPIO_CFGA_GPIO7OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO7OUTCFG_PUSHPULL        0x20000000
#define REG_GPIO_CFGA_GPIO7OUTCFG_OD              0x40000000
#define REG_GPIO_CFGA_GPIO7OUTCFG_TS              0x60000000

// GPIO7 input enable.
#define REG_GPIO_CFGA_GPIO7INCFG_S                28
#define REG_GPIO_CFGA_GPIO7INCFG_M                0x10000000
#define REG_GPIO_CFGA_GPIO7INCFG(n)               (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_CFGA_GPIO7INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO7INCFG_RDZERO           0x10000000

