mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO6 interrupt direction.
#define REG_GPIO_CFGA_GPIO6INTD_S                 27
#define REG_GPIO_CFGA_GPIO6INTD_M                 0x08000000
#define REG_GPIO_CFGA_GPIO6INTD(n)                (((uint32_t)(n) << 27) & 0x08000000)
#define REG_GPIO_CFGA_GPIO6INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO6INTD_INTHL             0x08000000

// GPIO6 output configuration.
#define REG_GPIO_CFGA_GPIO6OUTCFG_S               25
#define REG_GPIO_CFGA_GPIO6OUTCFG_M               0x06000000
#define REG_GPIO_CFGA_GPIO6OUTCFG(n)              (((uint32_t)(n) << 25) & 0x06000000)
#define REG_GPIO_CFGA_GPIO6OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO6OUTCFG_PUSHPULL        0x02000000
#define REG_GPIO_CFGA_GPIO6OUTCFG_OD              0x04000000
#define REG_GPIO_CFGA_GPIO6OUTCFG_TS              0x06000000

// GPIO6 input enable.
#define REG_GPIO_CFGA_GPIO6INCFG_S                24
#define REG_GPIO_CFGA_GPIO6INCFG_M                0x01000000
#define REG_GPIO_CFGA_GPIO6INCFG(n)               (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_CFGA_GPIO6INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO6INCFG_RDZERO           0x01000000

// GPIO5 interrupt direction.
#define REG_GPIO_CFGA_GPIO5INTD_S                 23
#define REG_GPIO_CFGA_GPIO5INTD_M                 0x00800000
#define REG_GPIO_CFGA_GPIO5INTD(n)                (((uint32_t)(n) << 23) & 0x00800000)
#define REG_GPIO_CFGA_GPIO5INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO5INTD_INTHL             0x00800000

// GPIO5 output configuration.
#define REG_GPIO_CFGA_GPIO5OUTCFG_S               21
#define REG_GPIO_CFGA_GPIO5OUTCFG_M               0x00600000
#define REG_GPIO_CFGA_GPIO5OUTCFG(n)              (((uint32_t)(n) << 21) & 0x00600000)
#define REG_GPIO_CFGA_GPIO5OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO5OUTCFG_PUSHPULL        0x00200000
#define REG_GPIO_CFGA_GPIO5OUTCFG_OD              0x00400000
#define REG_GPIO_CFGA_GPIO5OUTCFG_TS              0x00600000

// GPIO5 input enable.
#define REG_GPIO_CFGA_GPIO5INCFG_S                20
#define REG_GPIO_CFGA_GPIO5INCFG_M                0x00100000
#define REG_GPIO_CFGA_GPIO5INCFG(n)               (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_CFGA_GPIO5INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO5INCFG_RDZERO           0x00100000

// GPIO4 interrupt direction.
#define REG_GPIO_CFGA_GPIO4INTD_S                 19
#define REG_GPIO_CFGA_GPIO4INTD_M                 0x00080000
#define REG_GPIO_CFGA_GPIO4INTD(n)                (((uint32_t)(n) << 19) & 0x00080000)
#define REG_GPIO_CFGA_GPIO4INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO4INTD_INTHL             0x00080000

// GPIO4 output configuration.
#define REG_GPIO_CFGA_GPIO4OUTCFG_S               17
#define REG_GPIO_CFGA_GPIO4OUTCFG_M               0x00060000
#define REG_GPIO_CFGA_GPIO4OUTCFG(n)              (((uint32_t)(n) << 17) & 0x00060000)
#define REG_GPIO_CFGA_GPIO4OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO4OUTCFG_PUSHPULL        0x00020000
#define REG_GPIO_CFGA_GPIO4OUTCFG_OD              0x00040000
#define REG_GPIO_CFGA_GPIO4OUTCFG_TS              0x00060000

// GPIO4 input enable.
#define REG_GPIO_CFGA_GPIO4INCFG_S                16
#define REG_GPIO_CFGA_GPIO4INCFG_M                0x00010000
#define REG_GPIO_CFGA_GPIO4INCFG(n)               (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_CFGA_GPIO4INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO4INCFG_RDZERO           0x00010000

// GPIO3 interrupt direction.
#define REG_GPIO_CFGA_GPIO3INTD_S                 15
#define REG_GPIO_CFGA_GPIO3INTD_M                 0x00008000
#define REG_GPIO_CFGA_GPIO3INTD(n)                (((uint32_t)(n) << 15) & 0x00008000)
#define REG_GPIO_CFGA_GPIO3INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO3INTD_INTHL             0x00008000

// GPIO3 output configuration.
#define REG_GPIO_CFGA_GPIO3OUTCFG_S               13
#define REG_GPIO_CFGA_GPIO3OUTCFG_M               0x00006000
#define REG_GPIO_CFGA_GPIO3OUTCFG(n)              (((uint32_t)(n) << 13) & 0x00006000)
#define REG_GPIO_CFGA_GPIO3OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO3OUTCFG_PUSHPULL        0x00002000
#define REG_GPIO_CFGA_GPIO3OUTCFG_OD              0x00004000
#define REG_GPIO_CFGA_GPIO3OUTCFG_TS              0x00006000

// GPIO3 input enable.
#define REG_GPIO_CFGA_GPIO3INCFG_S                12
#define REG_GPIO_CFGA_GPIO3INCFG_M                0x00001000
#define REG_GPIO_CFGA_GPIO3INCFG(n)               (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_CFGA_GPIO3INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO3INCFG_RDZERO           0x00001000

// GPIO2 interrupt direction.
#define REG_GPIO_CFGA_GPIO2INTD_S                 11
#define REG_GPIO_CFGA_GPIO2INTD_M                 0x00000800
#define REG_GPIO_CFGA_GPIO2INTD(n)                (((uint32_t)(n) << 11) & 0x00000800)
#define REG_GPIO_CFGA_GPIO2INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO2INTD_INTHL             0x00000800

// GPIO2 output configuration.
#define REG_GPIO_CFGA_GPIO2OUTCFG_S               9
#define REG_GPIO_CFGA_GPIO2OUTCFG_M               0x00000600
#define REG_GPIO_CFGA_GPIO2OUTCFG(n)              (((uint32_t)(n) << 9) & 0x00000600)
#define REG_GPIO_CFGA_GPIO2OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO2OUTCFG_PUSHPULL        0x00000200
#define REG_GPIO_CFGA_GPIO2OUTCFG_OD              0x00000400
#define REG_GPIO_CFGA_GPIO2OUTCFG_TS              0x00000600

// GPIO2 input enable.
#define REG_GPIO_CFGA_GPIO2INCFG_S                8
#define REG_GPIO_CFGA_GPIO2INCFG_M                0x00000100
#define REG_GPIO_CFGA_GPIO2INCFG(n)               (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_CFGA_GPIO2INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO2INCFG_RDZERO           0x00000100

// GPIO1 interrupt direction.
#define REG_GPIO_CFGA_GPIO1INTD_S                 7
#define REG_GPIO_CFGA_GPIO1INTD_M                 0x00000080
#define REG_GPIO_CFGA_GPIO1INTD(n)                (((uint32_t)(n) << 7) & 0x00000080)
#define REG_GPIO_CFGA_GPIO1INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO1INTD_INTHL             0x00000080

// GPIO1 output configuration.
#define REG_GPIO_CFGA_GPIO1OUTCFG_S               5
#define REG_GPIO_CFGA_GPIO1OUTCFG_M               0x00000060
#define REG_GPIO_CFGA_GPIO1OUTCFG(n)              (((uint32_t)(n) << 5) & 0x00000060)
#define REG_GPIO_CFGA_GPIO1OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO1OUTCFG_PUSHPULL        0x00000020
#define REG_GPIO_CFGA_GPIO1OUTCFG_OD              0x00000040
#define REG_GPIO_CFGA_GPIO1OUTCFG_TS              0x00000060

// GPIO1 input enable.
#define REG_GPIO_CFGA_GPIO1INCFG_S                4
#define REG_GPIO_CFGA_GPIO1INCFG_M                0x00000010
#define REG_GPIO_CFGA_GPIO1INCFG(n)               (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_CFGA_GPIO1INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO1INCFG_RDZERO           0x00000010

