mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO0 interrupt direction.
#define REG_GPIO_CFGA_GPIO0INTD_S                 3
#define REG_GPIO_CFGA_GPIO0INTD_M                 0x00000008
#define REG_GPIO_CFGA_GPIO0INTD(n)                (((uint32_t)(n) << 3) & 0x00000008)
#define REG_GPIO_CFGA_GPIO0INTD_INTLH             0x00000000
#define REG_GPIO_CFGA_GPIO0INTD_INTHL             0x00000008

// GPIO0 output configuration.
#define REG_GPIO_CFGA_GPIO0OUTCFG_S               1
#define REG_GPIO_CFGA_GPIO0OUTCFG_M               0x00000006
#define REG_GPIO_CFGA_GPIO0OUTCFG(n)              (((uint32_t)(n) << 1) & 0x00000006)
#define REG_GPIO_CFGA_GPIO0OUTCFG_DIS             0x00000000
#define REG_GPIO_CFGA_GPIO0OUTCFG_PUSHPULL        0x00000002
#define REG_GPIO_CFGA_GPIO0OUTCFG_OD              0x00000004
#define REG_GPIO_CFGA_GPIO0OUTCFG_TS              0x00000006

// GPIO0 input enable.
#define REG_GPIO_CFGA_GPIO0INCFG_S                0
#define REG_GPIO_CFGA_GPIO0INCFG_M                0x00000001
#define REG_GPIO_CFGA_GPIO0INCFG(n)               (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_CFGA_GPIO0INCFG_READ             0x00000000
#define REG_GPIO_CFGA_GPIO0INCFG_RDZERO           0x00000001

//*****************************************************************************
//
// GPIO_CFGB - GPIO Configuration Register B
//
//*****************************************************************************
// GPIO15 interrupt direction.
#define REG_GPIO_CFGB_GPIO15INTD_S                31
#define REG_GPIO_CFGB_GPIO15INTD_M                0x80000000
#define REG_GPIO_CFGB_GPIO15INTD(n)               (((uint32_t)(n) << 31) & 0x80000000)
#define REG_GPIO_CFGB_GPIO15INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO15INTD_INTHL            0x80000000

// GPIO15 output configuration.
#define REG_GPIO_CFGB_GPIO15OUTCFG_S              29
#define REG_GPIO_CFGB_GPIO15OUTCFG_M              0x60000000
#define REG_GPIO_CFGB_GPIO15OUTCFG(n)             (((uint32_t)(n) << 29) & 0x60000000)
#define REG_GPIO_CFGB_GPIO15OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO15OUTCFG_PUSHPULL       0x20000000
#define REG_GPIO_CFGB_GPIO15OUTCFG_OD             0x40000000
#define REG_GPIO_CFGB_GPIO15OUTCFG_TS             0x60000000

// GPIO15 input enable.
#define REG_GPIO_CFGB_GPIO15INCFG_S               28
#define REG_GPIO_CFGB_GPIO15INCFG_M               0x10000000
#define REG_GPIO_CFGB_GPIO15INCFG(n)              (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_CFGB_GPIO15INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO15INCFG_RDZERO          0x10000000

// GPIO14 interrupt direction.
#define REG_GPIO_CFGB_GPIO14INTD_S                27
#define REG_GPIO_CFGB_GPIO14INTD_M                0x08000000
#define REG_GPIO_CFGB_GPIO14INTD(n)               (((uint32_t)(n) << 27) & 0x08000000)
#define REG_GPIO_CFGB_GPIO14INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO14INTD_INTHL            0x08000000

// GPIO14 output configuration.
#define REG_GPIO_CFGB_GPIO14OUTCFG_S              25
#define REG_GPIO_CFGB_GPIO14OUTCFG_M              0x06000000
#define REG_GPIO_CFGB_GPIO14OUTCFG(n)             (((uint32_t)(n) << 25) & 0x06000000)
#define REG_GPIO_CFGB_GPIO14OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO14OUTCFG_PUSHPULL       0x02000000
#define REG_GPIO_CFGB_GPIO14OUTCFG_OD             0x04000000
#define REG_GPIO_CFGB_GPIO14OUTCFG_TS             0x06000000

// GPIO14 input enable.
#define REG_GPIO_CFGB_GPIO14INCFG_S               24
#define REG_GPIO_CFGB_GPIO14INCFG_M               0x01000000
#define REG_GPIO_CFGB_GPIO14INCFG(n)              (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_CFGB_GPIO14INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO14INCFG_RDZERO          0x01000000

// GPIO13 interrupt direction.
#define REG_GPIO_CFGB_GPIO13INTD_S                23
#define REG_GPIO_CFGB_GPIO13INTD_M                0x00800000
#define REG_GPIO_CFGB_GPIO13INTD(n)               (((uint32_t)(n) << 23) & 0x00800000)
#define REG_GPIO_CFGB_GPIO13INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO13INTD_INTHL            0x00800000

// GPIO13 output configuration.
#define REG_GPIO_CFGB_GPIO13OUTCFG_S              21
#define REG_GPIO_CFGB_GPIO13OUTCFG_M              0x00600000
#define REG_GPIO_CFGB_GPIO13OUTCFG(n)             (((uint32_t)(n) << 21) & 0x00600000)
#define REG_GPIO_CFGB_GPIO13OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO13OUTCFG_PUSHPULL       0x00200000
#define REG_GPIO_CFGB_GPIO13OUTCFG_OD             0x00400000
#define REG_GPIO_CFGB_GPIO13OUTCFG_TS             0x00600000

// GPIO13 input enable.
#define REG_GPIO_CFGB_GPIO13INCFG_S               20
#define REG_GPIO_CFGB_GPIO13INCFG_M               0x00100000
#define REG_GPIO_CFGB_GPIO13INCFG(n)              (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_CFGB_GPIO13INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO13INCFG_RDZERO          0x00100000

// GPIO12 interrupt direction.
#define REG_GPIO_CFGB_GPIO12INTD_S                19
#define REG_GPIO_CFGB_GPIO12INTD_M                0x00080000
#define REG_GPIO_CFGB_GPIO12INTD(n)               (((uint32_t)(n) << 19) & 0x00080000)
#define REG_GPIO_CFGB_GPIO12INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO12INTD_INTHL            0x00080000

// GPIO12 output configuration.
#define REG_GPIO_CFGB_GPIO12OUTCFG_S              17
#define REG_GPIO_CFGB_GPIO12OUTCFG_M              0x00060000
#define REG_GPIO_CFGB_GPIO12OUTCFG(n)             (((uint32_t)(n) << 17) & 0x00060000)
#define REG_GPIO_CFGB_GPIO12OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO12OUTCFG_PUSHPULL       0x00020000
#define REG_GPIO_CFGB_GPIO12OUTCFG_OD             0x00040000
#define REG_GPIO_CFGB_GPIO12OUTCFG_TS             0x00060000

// GPIO12 input enable.
#define REG_GPIO_CFGB_GPIO12INCFG_S               16
#define REG_GPIO_CFGB_GPIO12INCFG_M               0x00010000
#define REG_GPIO_CFGB_GPIO12INCFG(n)              (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_CFGB_GPIO12INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO12INCFG_RDZERO          0x00010000

// GPIO11 interrupt direction.
#define REG_GPIO_CFGB_GPIO11INTD_S                15
#define REG_GPIO_CFGB_GPIO11INTD_M                0x00008000
#define REG_GPIO_CFGB_GPIO11INTD(n)               (((uint32_t)(n) << 15) & 0x00008000)
#define REG_GPIO_CFGB_GPIO11INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO11INTD_INTHL            0x00008000

// GPIO11 output configuration.
#define REG_GPIO_CFGB_GPIO11OUTCFG_S              13
#define REG_GPIO_CFGB_GPIO11OUTCFG_M              0x00006000
#define REG_GPIO_CFGB_GPIO11OUTCFG(n)             (((uint32_t)(n) << 13) & 0x00006000)
#define REG_GPIO_CFGB_GPIO11OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO11OUTCFG_PUSHPULL       0x00002000
#define REG_GPIO_CFGB_GPIO11OUTCFG_OD             0x00004000
#define REG_GPIO_CFGB_GPIO11OUTCFG_TS             0x00006000

// GPIO11 input enable.
#define REG_GPIO_CFGB_GPIO11INCFG_S               12
#define REG_GPIO_CFGB_GPIO11INCFG_M               0x00001000
#define REG_GPIO_CFGB_GPIO11INCFG(n)              (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_CFGB_GPIO11INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO11INCFG_RDZERO          0x00001000

// GPIO10 interrupt direction.
#define REG_GPIO_CFGB_GPIO10INTD_S                11
#define REG_GPIO_CFGB_GPIO10INTD_M                0x00000800
#define REG_GPIO_CFGB_GPIO10INTD(n)               (((uint32_t)(n) << 11) & 0x00000800)
#define REG_GPIO_CFGB_GPIO10INTD_INTLH            0x00000000
#define REG_GPIO_CFGB_GPIO10INTD_INTHL            0x00000800

// GPIO10 output configuration.
#define REG_GPIO_CFGB_GPIO10OUTCFG_S              9
#define REG_GPIO_CFGB_GPIO10OUTCFG_M              0x00000600
#define REG_GPIO_CFGB_GPIO10OUTCFG(n)             (((uint32_t)(n) << 9) & 0x00000600)
#define REG_GPIO_CFGB_GPIO10OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGB_GPIO10OUTCFG_PUSHPULL       0x00000200
#define REG_GPIO_CFGB_GPIO10OUTCFG_OD             0x00000400
#define REG_GPIO_CFGB_GPIO10OUTCFG_TS             0x00000600

// GPIO10 input enable.
#define REG_GPIO_CFGB_GPIO10INCFG_S               8
#define REG_GPIO_CFGB_GPIO10INCFG_M               0x00000100
#define REG_GPIO_CFGB_GPIO10INCFG(n)              (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_CFGB_GPIO10INCFG_READ            0x00000000
#define REG_GPIO_CFGB_GPIO10INCFG_RDZERO          0x00000100

