mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO20 interrupt direction.
#define REG_GPIO_CFGC_GPIO20INTD_S                19
#define REG_GPIO_CFGC_GPIO20INTD_M                0x00080000
#define REG_GPIO_CFGC_GPIO20INTD(n)               (((uint32_t)(n) << 19) & 0x00080000)
#define REG_GPIO_CFGC_GPIO20INTD_INTLH            0x00000000
#define REG_GPIO_CFGC_GPIO20INTD_INTHL            0x00080000

// GPIO20 output configuration.
#define REG_GPIO_CFGC_GPIO20OUTCFG_S              17
#define REG_GPIO_CFGC_GPIO20OUTCFG_M              0x00060000
#define REG_GPIO_CFGC_GPIO20OUTCFG(n)             (((uint32_t)(n) << 17) & 0x00060000)
#define REG_GPIO_CFGC_GPIO20OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGC_GPIO20OUTCFG_PUSHPULL       0x00020000
#define REG_GPIO_CFGC_GPIO20OUTCFG_OD             0x00040000
#define REG_GPIO_CFGC_GPIO20OUTCFG_TS             0x00060000

// GPIO20 input enable.
#define REG_GPIO_CFGC_GPIO20INCFG_S               16
#define REG_GPIO_CFGC_GPIO20INCFG_M               0x00010000
#define REG_GPIO_CFGC_GPIO20INCFG(n)              (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_CFGC_GPIO20INCFG_READ            0x00000000
#define REG_GPIO_CFGC_GPIO20INCFG_RDZERO          0x00010000

// GPIO19 interrupt direction.
#define REG_GPIO_CFGC_GPIO19INTD_S                15
#define REG_GPIO_CFGC_GPIO19INTD_M                0x00008000
#define REG_GPIO_CFGC_GPIO19INTD(n)               (((uint32_t)(n) << 15) & 0x00008000)
#define REG_GPIO_CFGC_GPIO19INTD_INTLH            0x00000000
#define REG_GPIO_CFGC_GPIO19INTD_INTHL            0x00008000

// GPIO19 output configuration.
#define REG_GPIO_CFGC_GPIO19OUTCFG_S              13
#define REG_GPIO_CFGC_GPIO19OUTCFG_M              0x00006000
#define REG_GPIO_CFGC_GPIO19OUTCFG(n)             (((uint32_t)(n) << 13) & 0x00006000)
#define REG_GPIO_CFGC_GPIO19OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGC_GPIO19OUTCFG_PUSHPULL       0x00002000
#define REG_GPIO_CFGC_GPIO19OUTCFG_OD             0x00004000
#define REG_GPIO_CFGC_GPIO19OUTCFG_TS             0x00006000

// GPIO19 input enable.
#define REG_GPIO_CFGC_GPIO19INCFG_S               12
#define REG_GPIO_CFGC_GPIO19INCFG_M               0x00001000
#define REG_GPIO_CFGC_GPIO19INCFG(n)              (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_CFGC_GPIO19INCFG_READ            0x00000000
#define REG_GPIO_CFGC_GPIO19INCFG_RDZERO          0x00001000

// GPIO18 interrupt direction.
#define REG_GPIO_CFGC_GPIO18INTD_S                11
#define REG_GPIO_CFGC_GPIO18INTD_M                0x00000800
#define REG_GPIO_CFGC_GPIO18INTD(n)               (((uint32_t)(n) << 11) & 0x00000800)
#define REG_GPIO_CFGC_GPIO18INTD_INTLH            0x00000000
#define REG_GPIO_CFGC_GPIO18INTD_INTHL            0x00000800

// GPIO18 output configuration.
#define REG_GPIO_CFGC_GPIO18OUTCFG_S              9
#define REG_GPIO_CFGC_GPIO18OUTCFG_M              0x00000600
#define REG_GPIO_CFGC_GPIO18OUTCFG(n)             (((uint32_t)(n) << 9) & 0x00000600)
#define REG_GPIO_CFGC_GPIO18OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGC_GPIO18OUTCFG_PUSHPULL       0x00000200
#define REG_GPIO_CFGC_GPIO18OUTCFG_OD             0x00000400
#define REG_GPIO_CFGC_GPIO18OUTCFG_TS             0x00000600

// GPIO18 input enable.
#define REG_GPIO_CFGC_GPIO18INCFG_S               8
#define REG_GPIO_CFGC_GPIO18INCFG_M               0x00000100
#define REG_GPIO_CFGC_GPIO18INCFG(n)              (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_CFGC_GPIO18INCFG_READ            0x00000000
#define REG_GPIO_CFGC_GPIO18INCFG_RDZERO          0x00000100

// GPIO17 interrupt direction.
#define REG_GPIO_CFGC_GPIO17INTD_S                7
#define REG_GPIO_CFGC_GPIO17INTD_M                0x00000080
#define REG_GPIO_CFGC_GPIO17INTD(n)               (((uint32_t)(n) << 7) & 0x00000080)
#define REG_GPIO_CFGC_GPIO17INTD_INTLH            0x00000000
#define REG_GPIO_CFGC_GPIO17INTD_INTHL            0x00000080

// GPIO17 output configuration.
#define REG_GPIO_CFGC_GPIO17OUTCFG_S              5
#define REG_GPIO_CFGC_GPIO17OUTCFG_M              0x00000060
#define REG_GPIO_CFGC_GPIO17OUTCFG(n)             (((uint32_t)(n) << 5) & 0x00000060)
#define REG_GPIO_CFGC_GPIO17OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGC_GPIO17OUTCFG_PUSHPULL       0x00000020
#define REG_GPIO_CFGC_GPIO17OUTCFG_OD             0x00000040
#define REG_GPIO_CFGC_GPIO17OUTCFG_TS             0x00000060

// GPIO17 input enable.
#define REG_GPIO_CFGC_GPIO17INCFG_S               4
#define REG_GPIO_CFGC_GPIO17INCFG_M               0x00000010
#define REG_GPIO_CFGC_GPIO17INCFG(n)              (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_CFGC_GPIO17INCFG_READ            0x00000000
#define REG_GPIO_CFGC_GPIO17INCFG_RDZERO          0x00000010

// GPIO16 interrupt direction.
#define REG_GPIO_CFGC_GPIO16INTD_S                3
#define REG_GPIO_CFGC_GPIO16INTD_M                0x00000008
#define REG_GPIO_CFGC_GPIO16INTD(n)               (((uint32_t)(n) << 3) & 0x00000008)
#define REG_GPIO_CFGC_GPIO16INTD_INTLH            0x00000000
#define REG_GPIO_CFGC_GPIO16INTD_INTHL            0x00000008

// GPIO16 output configuration.
#define REG_GPIO_CFGC_GPIO16OUTCFG_S              1
#define REG_GPIO_CFGC_GPIO16OUTCFG_M              0x00000006
#define REG_GPIO_CFGC_GPIO16OUTCFG(n)             (((uint32_t)(n) << 1) & 0x00000006)
#define REG_GPIO_CFGC_GPIO16OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGC_GPIO16OUTCFG_PUSHPULL       0x00000002
#define REG_GPIO_CFGC_GPIO16OUTCFG_OD             0x00000004
#define REG_GPIO_CFGC_GPIO16OUTCFG_TS             0x00000006

// GPIO16 input enable.
#define REG_GPIO_CFGC_GPIO16INCFG_S               0
#define REG_GPIO_CFGC_GPIO16INCFG_M               0x00000001
#define REG_GPIO_CFGC_GPIO16INCFG(n)              (((uint32_t)(n) << 0) & 0x00000001)
#define REG_GPIO_CFGC_GPIO16INCFG_READ            0x00000000
#define REG_GPIO_CFGC_GPIO16INCFG_RDZERO          0x00000001

//*****************************************************************************
//
// GPIO_CFGD - GPIO Configuration Register D
//
//*****************************************************************************
// GPIO31 interrupt direction.
#define REG_GPIO_CFGD_GPIO31INTD_S                31
#define REG_GPIO_CFGD_GPIO31INTD_M                0x80000000
#define REG_GPIO_CFGD_GPIO31INTD(n)               (((uint32_t)(n) << 31) & 0x80000000)
#define REG_GPIO_CFGD_GPIO31INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO31INTD_INTHL            0x80000000

// GPIO31 output configuration.
#define REG_GPIO_CFGD_GPIO31OUTCFG_S              29
#define REG_GPIO_CFGD_GPIO31OUTCFG_M              0x60000000
#define REG_GPIO_CFGD_GPIO31OUTCFG(n)             (((uint32_t)(n) << 29) & 0x60000000)
#define REG_GPIO_CFGD_GPIO31OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO31OUTCFG_PUSHPULL       0x20000000
#define REG_GPIO_CFGD_GPIO31OUTCFG_OD             0x40000000
#define REG_GPIO_CFGD_GPIO31OUTCFG_TS             0x60000000

