mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// GPIO31 input enable.
#define REG_GPIO_CFGD_GPIO31INCFG_S               28
#define REG_GPIO_CFGD_GPIO31INCFG_M               0x10000000
#define REG_GPIO_CFGD_GPIO31INCFG(n)              (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_CFGD_GPIO31INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO31INCFG_RDZERO          0x10000000

// GPIO30 interrupt direction.
#define REG_GPIO_CFGD_GPIO30INTD_S                27
#define REG_GPIO_CFGD_GPIO30INTD_M                0x08000000
#define REG_GPIO_CFGD_GPIO30INTD(n)               (((uint32_t)(n) << 27) & 0x08000000)
#define REG_GPIO_CFGD_GPIO30INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO30INTD_INTHL            0x08000000

// GPIO30 output configuration.
#define REG_GPIO_CFGD_GPIO30OUTCFG_S              25
#define REG_GPIO_CFGD_GPIO30OUTCFG_M              0x06000000
#define REG_GPIO_CFGD_GPIO30OUTCFG(n)             (((uint32_t)(n) << 25) & 0x06000000)
#define REG_GPIO_CFGD_GPIO30OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO30OUTCFG_PUSHPULL       0x02000000
#define REG_GPIO_CFGD_GPIO30OUTCFG_OD             0x04000000
#define REG_GPIO_CFGD_GPIO30OUTCFG_TS             0x06000000

// GPIO30 input enable.
#define REG_GPIO_CFGD_GPIO30INCFG_S               24
#define REG_GPIO_CFGD_GPIO30INCFG_M               0x01000000
#define REG_GPIO_CFGD_GPIO30INCFG(n)              (((uint32_t)(n) << 24) & 0x01000000)
#define REG_GPIO_CFGD_GPIO30INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO30INCFG_RDZERO          0x01000000

// GPIO29 interrupt direction.
#define REG_GPIO_CFGD_GPIO29INTD_S                23
#define REG_GPIO_CFGD_GPIO29INTD_M                0x00800000
#define REG_GPIO_CFGD_GPIO29INTD(n)               (((uint32_t)(n) << 23) & 0x00800000)
#define REG_GPIO_CFGD_GPIO29INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO29INTD_INTHL            0x00800000

// GPIO29 output configuration.
#define REG_GPIO_CFGD_GPIO29OUTCFG_S              21
#define REG_GPIO_CFGD_GPIO29OUTCFG_M              0x00600000
#define REG_GPIO_CFGD_GPIO29OUTCFG(n)             (((uint32_t)(n) << 21) & 0x00600000)
#define REG_GPIO_CFGD_GPIO29OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO29OUTCFG_PUSHPULL       0x00200000
#define REG_GPIO_CFGD_GPIO29OUTCFG_OD             0x00400000
#define REG_GPIO_CFGD_GPIO29OUTCFG_TS             0x00600000

// GPIO29 input enable.
#define REG_GPIO_CFGD_GPIO29INCFG_S               20
#define REG_GPIO_CFGD_GPIO29INCFG_M               0x00100000
#define REG_GPIO_CFGD_GPIO29INCFG(n)              (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_CFGD_GPIO29INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO29INCFG_RDZERO          0x00100000

// GPIO28 interrupt direction.
#define REG_GPIO_CFGD_GPIO28INTD_S                19
#define REG_GPIO_CFGD_GPIO28INTD_M                0x00080000
#define REG_GPIO_CFGD_GPIO28INTD(n)               (((uint32_t)(n) << 19) & 0x00080000)
#define REG_GPIO_CFGD_GPIO28INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO28INTD_INTHL            0x00080000

// GPIO28 output configuration.
#define REG_GPIO_CFGD_GPIO28OUTCFG_S              17
#define REG_GPIO_CFGD_GPIO28OUTCFG_M              0x00060000
#define REG_GPIO_CFGD_GPIO28OUTCFG(n)             (((uint32_t)(n) << 17) & 0x00060000)
#define REG_GPIO_CFGD_GPIO28OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO28OUTCFG_PUSHPULL       0x00020000
#define REG_GPIO_CFGD_GPIO28OUTCFG_OD             0x00040000
#define REG_GPIO_CFGD_GPIO28OUTCFG_TS             0x00060000

// GPIO28 input enable.
#define REG_GPIO_CFGD_GPIO28INCFG_S               16
#define REG_GPIO_CFGD_GPIO28INCFG_M               0x00010000
#define REG_GPIO_CFGD_GPIO28INCFG(n)              (((uint32_t)(n) << 16) & 0x00010000)
#define REG_GPIO_CFGD_GPIO28INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO28INCFG_RDZERO          0x00010000

// GPIO27 interrupt direction.
#define REG_GPIO_CFGD_GPIO27INTD_S                15
#define REG_GPIO_CFGD_GPIO27INTD_M                0x00008000
#define REG_GPIO_CFGD_GPIO27INTD(n)               (((uint32_t)(n) << 15) & 0x00008000)
#define REG_GPIO_CFGD_GPIO27INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO27INTD_INTHL            0x00008000

// GPIO27 output configuration.
#define REG_GPIO_CFGD_GPIO27OUTCFG_S              13
#define REG_GPIO_CFGD_GPIO27OUTCFG_M              0x00006000
#define REG_GPIO_CFGD_GPIO27OUTCFG(n)             (((uint32_t)(n) << 13) & 0x00006000)
#define REG_GPIO_CFGD_GPIO27OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO27OUTCFG_PUSHPULL       0x00002000
#define REG_GPIO_CFGD_GPIO27OUTCFG_OD             0x00004000
#define REG_GPIO_CFGD_GPIO27OUTCFG_TS             0x00006000

// GPIO27 input enable.
#define REG_GPIO_CFGD_GPIO27INCFG_S               12
#define REG_GPIO_CFGD_GPIO27INCFG_M               0x00001000
#define REG_GPIO_CFGD_GPIO27INCFG(n)              (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_CFGD_GPIO27INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO27INCFG_RDZERO          0x00001000

// GPIO26 interrupt direction.
#define REG_GPIO_CFGD_GPIO26INTD_S                11
#define REG_GPIO_CFGD_GPIO26INTD_M                0x00000800
#define REG_GPIO_CFGD_GPIO26INTD(n)               (((uint32_t)(n) << 11) & 0x00000800)
#define REG_GPIO_CFGD_GPIO26INTD_INTLH            0x00000000
#define REG_GPIO_CFGD_GPIO26INTD_INTHL            0x00000800

// GPIO26 output configuration.
#define REG_GPIO_CFGD_GPIO26OUTCFG_S              9
#define REG_GPIO_CFGD_GPIO26OUTCFG_M              0x00000600
#define REG_GPIO_CFGD_GPIO26OUTCFG(n)             (((uint32_t)(n) << 9) & 0x00000600)
#define REG_GPIO_CFGD_GPIO26OUTCFG_DIS            0x00000000
#define REG_GPIO_CFGD_GPIO26OUTCFG_PUSHPULL       0x00000200
#define REG_GPIO_CFGD_GPIO26OUTCFG_OD             0x00000400
#define REG_GPIO_CFGD_GPIO26OUTCFG_TS             0x00000600

// GPIO26 input enable.
#define REG_GPIO_CFGD_GPIO26INCFG_S               8
#define REG_GPIO_CFGD_GPIO26INCFG_M               0x00000100
#define REG_GPIO_CFGD_GPIO26INCFG(n)              (((uint32_t)(n) << 8) & 0x00000100)
#define REG_GPIO_CFGD_GPIO26INCFG_READ            0x00000000
#define REG_GPIO_CFGD_GPIO26INCFG_RDZERO          0x00000100

