mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// STIMER Capture 2 Select.
#define REG_GPIO_STMRCAP_STSEL2_S                 16
#define REG_GPIO_STMRCAP_STSEL2_M                 0x003F0000
#define REG_GPIO_STMRCAP_STSEL2(n)                (((uint32_t)(n) << 16) & 0x003F0000)

// STIMER Capture 1 Polarity.
#define REG_GPIO_STMRCAP_STPOL1_S                 14
#define REG_GPIO_STMRCAP_STPOL1_M                 0x00004000
#define REG_GPIO_STMRCAP_STPOL1(n)                (((uint32_t)(n) << 14) & 0x00004000)
#define REG_GPIO_STMRCAP_STPOL1_CAPLH             0x00000000
#define REG_GPIO_STMRCAP_STPOL1_CAPHL             0x00004000

// STIMER Capture 1 Select.
#define REG_GPIO_STMRCAP_STSEL1_S                 8
#define REG_GPIO_STMRCAP_STSEL1_M                 0x00003F00
#define REG_GPIO_STMRCAP_STSEL1(n)                (((uint32_t)(n) << 8) & 0x00003F00)

// STIMER Capture 0 Polarity.
#define REG_GPIO_STMRCAP_STPOL0_S                 6
#define REG_GPIO_STMRCAP_STPOL0_M                 0x00000040
#define REG_GPIO_STMRCAP_STPOL0(n)                (((uint32_t)(n) << 6) & 0x00000040)
#define REG_GPIO_STMRCAP_STPOL0_CAPLH             0x00000000
#define REG_GPIO_STMRCAP_STPOL0_CAPHL             0x00000040

// STIMER Capture 0 Select.
#define REG_GPIO_STMRCAP_STSEL0_S                 0
#define REG_GPIO_STMRCAP_STSEL0_M                 0x0000003F
#define REG_GPIO_STMRCAP_STSEL0(n)                (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM0IRQ - IOM0 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR0 IRQ pad select.
#define REG_GPIO_IOM0IRQ_IOM0IRQ_S                0
#define REG_GPIO_IOM0IRQ_IOM0IRQ_M                0x0000003F
#define REG_GPIO_IOM0IRQ_IOM0IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM1IRQ - IOM1 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR1 IRQ pad select.
#define REG_GPIO_IOM1IRQ_IOM1IRQ_S                0
#define REG_GPIO_IOM1IRQ_IOM1IRQ_M                0x0000003F
#define REG_GPIO_IOM1IRQ_IOM1IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM2IRQ - IOM2 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR2 IRQ pad select.
#define REG_GPIO_IOM2IRQ_IOM2IRQ_S                0
#define REG_GPIO_IOM2IRQ_IOM2IRQ_M                0x0000003F
#define REG_GPIO_IOM2IRQ_IOM2IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM3IRQ - IOM3 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR3 IRQ pad select.
#define REG_GPIO_IOM3IRQ_IOM3IRQ_S                0
#define REG_GPIO_IOM3IRQ_IOM3IRQ_M                0x0000003F
#define REG_GPIO_IOM3IRQ_IOM3IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM4IRQ - IOM4 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR4 IRQ pad select.
#define REG_GPIO_IOM4IRQ_IOM4IRQ_S                0
#define REG_GPIO_IOM4IRQ_IOM4IRQ_M                0x0000003F
#define REG_GPIO_IOM4IRQ_IOM4IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_IOM5IRQ - IOM5 Flow Control IRQ Select
//
//*****************************************************************************
// IOMSTR5 IRQ pad select.
#define REG_GPIO_IOM5IRQ_IOM5IRQ_S                0
#define REG_GPIO_IOM5IRQ_IOM5IRQ_M                0x0000003F
#define REG_GPIO_IOM5IRQ_IOM5IRQ(n)               (((uint32_t)(n) << 0) & 0x0000003F)

//*****************************************************************************
//
// GPIO_LOOPBACK - IOM to IOS Loopback Control
//
//*****************************************************************************
// IOM to IOS loopback control.
#define REG_GPIO_LOOPBACK_LOOPBACK_S              0
#define REG_GPIO_LOOPBACK_LOOPBACK_M              0x00000007
#define REG_GPIO_LOOPBACK_LOOPBACK(n)             (((uint32_t)(n) << 0) & 0x00000007)
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP0          0x00000000
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP1          0x00000001
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP2          0x00000002
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP3          0x00000003
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP4          0x00000004
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOP5          0x00000005
#define REG_GPIO_LOOPBACK_LOOPBACK_LOOPNONE       0x00000006

//*****************************************************************************
//
// GPIO_GPIOOBS - GPIO Observation Mode Sample register
//
//*****************************************************************************
// Sample of the data output on the GPIO observation port.  May have async
// sampling issues, as the data is not synronized to the read operation.
// Intended for debug purposes only
#define REG_GPIO_GPIOOBS_OBS_DATA_S               0
#define REG_GPIO_GPIOOBS_OBS_DATA_M               0x0000FFFF
#define REG_GPIO_GPIOOBS_OBS_DATA(n)              (((uint32_t)(n) << 0) & 0x0000FFFF)

//*****************************************************************************
//
// GPIO_ALTPADCFGA - Alternate Pad Configuration reg0 (Pads 3,2,1,0)
//
//*****************************************************************************
// Pad 3 slew rate selection.
#define REG_GPIO_ALTPADCFGA_PAD3_SR_S             28
#define REG_GPIO_ALTPADCFGA_PAD3_SR_M             0x10000000
#define REG_GPIO_ALTPADCFGA_PAD3_SR(n)            (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGA_PAD3_SR_SR_EN         0x10000000

