mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 21 high order drive strength selection.  Used in conjunction with
// PAD21STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGF_PAD21_DS1_S           8
#define REG_GPIO_ALTPADCFGF_PAD21_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGF_PAD21_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 20 slew rate selection.
#define REG_GPIO_ALTPADCFGF_PAD20_SR_S            4
#define REG_GPIO_ALTPADCFGF_PAD20_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGF_PAD20_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGF_PAD20_SR_SR_EN        0x00000010

// Pad 20 high order drive strength selection.  Used in conjunction with
// PAD20STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGF_PAD20_DS1_S           0
#define REG_GPIO_ALTPADCFGF_PAD20_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGF_PAD20_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGG - Alternate Pad Configuration reg6 (Pads 27,26,25,24)
//
//*****************************************************************************
// Pad 27 slew rate selection.
#define REG_GPIO_ALTPADCFGG_PAD27_SR_S            28
#define REG_GPIO_ALTPADCFGG_PAD27_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGG_PAD27_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGG_PAD27_SR_SR_EN        0x10000000

// Pad 27 high order drive strength selection.  Used in conjunction with
// PAD27STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGG_PAD27_DS1_S           24
#define REG_GPIO_ALTPADCFGG_PAD27_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGG_PAD27_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 26 slew rate selection.
#define REG_GPIO_ALTPADCFGG_PAD26_SR_S            20
#define REG_GPIO_ALTPADCFGG_PAD26_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGG_PAD26_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGG_PAD26_SR_SR_EN        0x00100000

// Pad 26 high order drive strength selection.  Used in conjunction with
// PAD26STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGG_PAD26_DS1_S           16
#define REG_GPIO_ALTPADCFGG_PAD26_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGG_PAD26_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 25 slew rate selection.
#define REG_GPIO_ALTPADCFGG_PAD25_SR_S            12
#define REG_GPIO_ALTPADCFGG_PAD25_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGG_PAD25_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGG_PAD25_SR_SR_EN        0x00001000

// Pad 25 high order drive strength selection.  Used in conjunction with
// PAD25STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGG_PAD25_DS1_S           8
#define REG_GPIO_ALTPADCFGG_PAD25_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGG_PAD25_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 24 slew rate selection.
#define REG_GPIO_ALTPADCFGG_PAD24_SR_S            4
#define REG_GPIO_ALTPADCFGG_PAD24_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGG_PAD24_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGG_PAD24_SR_SR_EN        0x00000010

// Pad 24 high order drive strength selection.  Used in conjunction with
// PAD24STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGG_PAD24_DS1_S           0
#define REG_GPIO_ALTPADCFGG_PAD24_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGG_PAD24_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGH - Alternate Pad Configuration reg7 (Pads 31,30,29,28)
//
//*****************************************************************************
// Pad 31 slew rate selection.
#define REG_GPIO_ALTPADCFGH_PAD31_SR_S            28
#define REG_GPIO_ALTPADCFGH_PAD31_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGH_PAD31_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGH_PAD31_SR_SR_EN        0x10000000

// Pad 31 high order drive strength selection.  Used in conjunction with
// PAD31STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGH_PAD31_DS1_S           24
#define REG_GPIO_ALTPADCFGH_PAD31_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGH_PAD31_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 30 slew rate selection.
#define REG_GPIO_ALTPADCFGH_PAD30_SR_S            20
#define REG_GPIO_ALTPADCFGH_PAD30_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGH_PAD30_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGH_PAD30_SR_SR_EN        0x00100000

// Pad 30 high order drive strength selection.  Used in conjunction with
// PAD30STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGH_PAD30_DS1_S           16
#define REG_GPIO_ALTPADCFGH_PAD30_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGH_PAD30_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 29 slew rate selection.
#define REG_GPIO_ALTPADCFGH_PAD29_SR_S            12
#define REG_GPIO_ALTPADCFGH_PAD29_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGH_PAD29_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGH_PAD29_SR_SR_EN        0x00001000

// Pad 29 high order drive strength selection.  Used in conjunction with
// PAD29STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGH_PAD29_DS1_S           8
#define REG_GPIO_ALTPADCFGH_PAD29_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGH_PAD29_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 28 slew rate selection.
#define REG_GPIO_ALTPADCFGH_PAD28_SR_S            4
#define REG_GPIO_ALTPADCFGH_PAD28_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGH_PAD28_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGH_PAD28_SR_SR_EN        0x00000010

// Pad 28 high order drive strength selection.  Used in conjunction with
// PAD28STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGH_PAD28_DS1_S           0
#define REG_GPIO_ALTPADCFGH_PAD28_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGH_PAD28_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGI - Alternate Pad Configuration reg8 (Pads 35,34,33,32)
//
//*****************************************************************************
// Pad 35 slew rate selection.
#define REG_GPIO_ALTPADCFGI_PAD35_SR_S            28
#define REG_GPIO_ALTPADCFGI_PAD35_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGI_PAD35_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGI_PAD35_SR_SR_EN        0x10000000

// Pad 35 high order drive strength selection.  Used in conjunction with
// PAD35STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGI_PAD35_DS1_S           24
#define REG_GPIO_ALTPADCFGI_PAD35_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGI_PAD35_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 34 slew rate selection.
#define REG_GPIO_ALTPADCFGI_PAD34_SR_S            20
#define REG_GPIO_ALTPADCFGI_PAD34_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGI_PAD34_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGI_PAD34_SR_SR_EN        0x00100000

