mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 34 high order drive strength selection.  Used in conjunction with
// PAD34STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGI_PAD34_DS1_S           16
#define REG_GPIO_ALTPADCFGI_PAD34_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGI_PAD34_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 33 slew rate selection.
#define REG_GPIO_ALTPADCFGI_PAD33_SR_S            12
#define REG_GPIO_ALTPADCFGI_PAD33_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGI_PAD33_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGI_PAD33_SR_SR_EN        0x00001000

// Pad 33 high order drive strength selection.  Used in conjunction with
// PAD33STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGI_PAD33_DS1_S           8
#define REG_GPIO_ALTPADCFGI_PAD33_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGI_PAD33_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 32 slew rate selection.
#define REG_GPIO_ALTPADCFGI_PAD32_SR_S            4
#define REG_GPIO_ALTPADCFGI_PAD32_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGI_PAD32_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGI_PAD32_SR_SR_EN        0x00000010

// Pad 32 high order drive strength selection.  Used in conjunction with
// PAD32STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGI_PAD32_DS1_S           0
#define REG_GPIO_ALTPADCFGI_PAD32_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGI_PAD32_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGJ - Alternate Pad Configuration reg9 (Pads 39,38,37,36)
//
//*****************************************************************************
// Pad 39 slew rate selection.
#define REG_GPIO_ALTPADCFGJ_PAD39_SR_S            28
#define REG_GPIO_ALTPADCFGJ_PAD39_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGJ_PAD39_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGJ_PAD39_SR_SR_EN        0x10000000

// Pad 39 high order drive strength selection.  Used in conjunction with
// PAD39STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGJ_PAD39_DS1_S           24
#define REG_GPIO_ALTPADCFGJ_PAD39_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGJ_PAD39_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 38 slew rate selection.
#define REG_GPIO_ALTPADCFGJ_PAD38_SR_S            20
#define REG_GPIO_ALTPADCFGJ_PAD38_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGJ_PAD38_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGJ_PAD38_SR_SR_EN        0x00100000

// Pad 38 high order drive strength selection.  Used in conjunction with
// PAD38STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGJ_PAD38_DS1_S           16
#define REG_GPIO_ALTPADCFGJ_PAD38_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGJ_PAD38_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 37 slew rate selection.
#define REG_GPIO_ALTPADCFGJ_PAD37_SR_S            12
#define REG_GPIO_ALTPADCFGJ_PAD37_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGJ_PAD37_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGJ_PAD37_SR_SR_EN        0x00001000

// Pad 37 high order drive strength selection.  Used in conjunction with
// PAD37STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGJ_PAD37_DS1_S           8
#define REG_GPIO_ALTPADCFGJ_PAD37_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGJ_PAD37_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 36 slew rate selection.
#define REG_GPIO_ALTPADCFGJ_PAD36_SR_S            4
#define REG_GPIO_ALTPADCFGJ_PAD36_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGJ_PAD36_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGJ_PAD36_SR_SR_EN        0x00000010

// Pad 36 high order drive strength selection.  Used in conjunction with
// PAD36STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGJ_PAD36_DS1_S           0
#define REG_GPIO_ALTPADCFGJ_PAD36_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGJ_PAD36_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGK - Alternate Pad Configuration reg10 (Pads 43,42,41,40)
//
//*****************************************************************************
// Pad 43 slew rate selection.
#define REG_GPIO_ALTPADCFGK_PAD43_SR_S            28
#define REG_GPIO_ALTPADCFGK_PAD43_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGK_PAD43_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGK_PAD43_SR_SR_EN        0x10000000

// Pad 43 high order drive strength selection.  Used in conjunction with
// PAD43STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGK_PAD43_DS1_S           24
#define REG_GPIO_ALTPADCFGK_PAD43_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGK_PAD43_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 42 slew rate selection.
#define REG_GPIO_ALTPADCFGK_PAD42_SR_S            20
#define REG_GPIO_ALTPADCFGK_PAD42_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGK_PAD42_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGK_PAD42_SR_SR_EN        0x00100000

// Pad 42 high order drive strength selection.  Used in conjunction with
// PAD42STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGK_PAD42_DS1_S           16
#define REG_GPIO_ALTPADCFGK_PAD42_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGK_PAD42_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 41 slew rate selection.
#define REG_GPIO_ALTPADCFGK_PAD41_SR_S            12
#define REG_GPIO_ALTPADCFGK_PAD41_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGK_PAD41_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGK_PAD41_SR_SR_EN        0x00001000

// Pad 41 high order drive strength selection.  Used in conjunction with
// PAD41STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGK_PAD41_DS1_S           8
#define REG_GPIO_ALTPADCFGK_PAD41_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGK_PAD41_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 40 slew rate selection.
#define REG_GPIO_ALTPADCFGK_PAD40_SR_S            4
#define REG_GPIO_ALTPADCFGK_PAD40_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGK_PAD40_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGK_PAD40_SR_SR_EN        0x00000010

// Pad 40 high order drive strength selection.  Used in conjunction with
// PAD40STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGK_PAD40_DS1_S           0
#define REG_GPIO_ALTPADCFGK_PAD40_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGK_PAD40_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGL - Alternate Pad Configuration reg11 (Pads 47,46,45,44)
//
//*****************************************************************************
// Pad 47 slew rate selection.
#define REG_GPIO_ALTPADCFGL_PAD47_SR_S            28
#define REG_GPIO_ALTPADCFGL_PAD47_SR_M            0x10000000
#define REG_GPIO_ALTPADCFGL_PAD47_SR(n)           (((uint32_t)(n) << 28) & 0x10000000)
#define REG_GPIO_ALTPADCFGL_PAD47_SR_SR_EN        0x10000000

// Pad 47 high order drive strength selection.  Used in conjunction with
// PAD47STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGL_PAD47_DS1_S           24
#define REG_GPIO_ALTPADCFGL_PAD47_DS1_M           0x01000000
#define REG_GPIO_ALTPADCFGL_PAD47_DS1(n)          (((uint32_t)(n) << 24) & 0x01000000)

// Pad 46 slew rate selection.
#define REG_GPIO_ALTPADCFGL_PAD46_SR_S            20
#define REG_GPIO_ALTPADCFGL_PAD46_SR_M            0x00100000
#define REG_GPIO_ALTPADCFGL_PAD46_SR(n)           (((uint32_t)(n) << 20) & 0x00100000)
#define REG_GPIO_ALTPADCFGL_PAD46_SR_SR_EN        0x00100000

// Pad 46 high order drive strength selection.  Used in conjunction with
// PAD46STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGL_PAD46_DS1_S           16
#define REG_GPIO_ALTPADCFGL_PAD46_DS1_M           0x00010000
#define REG_GPIO_ALTPADCFGL_PAD46_DS1(n)          (((uint32_t)(n) << 16) & 0x00010000)

// Pad 45 slew rate selection.
#define REG_GPIO_ALTPADCFGL_PAD45_SR_S            12
#define REG_GPIO_ALTPADCFGL_PAD45_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGL_PAD45_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGL_PAD45_SR_SR_EN        0x00001000

// Pad 45 high order drive strength selection.  Used in conjunction with
// PAD45STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGL_PAD45_DS1_S           8
#define REG_GPIO_ALTPADCFGL_PAD45_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGL_PAD45_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 44 slew rate selection.
#define REG_GPIO_ALTPADCFGL_PAD44_SR_S            4
#define REG_GPIO_ALTPADCFGL_PAD44_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGL_PAD44_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGL_PAD44_SR_SR_EN        0x00000010

