mcushilei/UCPF/pedestals/on_chip_peripherals/arm/cortex_m4/ambiq/apollo2/common/gpio/reg_gpio.h
// Pad 44 high order drive strength selection.  Used in conjunction with
// PAD44STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGL_PAD44_DS1_S           0
#define REG_GPIO_ALTPADCFGL_PAD44_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGL_PAD44_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// GPIO_ALTPADCFGM - Alternate Pad Configuration reg12 (Pads 49,48)
//
//*****************************************************************************
// Pad 49 slew rate selection.
#define REG_GPIO_ALTPADCFGM_PAD49_SR_S            12
#define REG_GPIO_ALTPADCFGM_PAD49_SR_M            0x00001000
#define REG_GPIO_ALTPADCFGM_PAD49_SR(n)           (((uint32_t)(n) << 12) & 0x00001000)
#define REG_GPIO_ALTPADCFGM_PAD49_SR_SR_EN        0x00001000

// Pad 49 high order drive strength selection.  Used in conjunction with
// PAD49STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGM_PAD49_DS1_S           8
#define REG_GPIO_ALTPADCFGM_PAD49_DS1_M           0x00000100
#define REG_GPIO_ALTPADCFGM_PAD49_DS1(n)          (((uint32_t)(n) << 8) & 0x00000100)

// Pad 48 slew rate selection.
#define REG_GPIO_ALTPADCFGM_PAD48_SR_S            4
#define REG_GPIO_ALTPADCFGM_PAD48_SR_M            0x00000010
#define REG_GPIO_ALTPADCFGM_PAD48_SR(n)           (((uint32_t)(n) << 4) & 0x00000010)
#define REG_GPIO_ALTPADCFGM_PAD48_SR_SR_EN        0x00000010

// Pad 48 high order drive strength selection.  Used in conjunction with
// PAD48STRNG field to set the pad drive strength.
#define REG_GPIO_ALTPADCFGM_PAD48_DS1_S           0
#define REG_GPIO_ALTPADCFGM_PAD48_DS1_M           0x00000001
#define REG_GPIO_ALTPADCFGM_PAD48_DS1(n)          (((uint32_t)(n) << 0) & 0x00000001)


/*============================ MACROFIED FUNCTIONS ===========================*/
/*============================ TYPES =========================================*/

typedef volatile struct {
    union {
        struct {
            reg32_t PADREGA;
            reg32_t PADREGB;
            reg32_t PADREGC;
            reg32_t PADREGD;
            
            reg32_t PADREGE;
            reg32_t PADREGF;
            reg32_t PADREGG;
            reg32_t PADREGH;
            
            reg32_t PADREGI;
            reg32_t PADREGJ;
            reg32_t PADREGK;
            reg32_t PADREGL;
            
            reg32_t PADREGM;
        };
        reg32_t PADREG[13];
    };
    REG32_RSVD(3)
        
    union {
        struct {
            reg32_t CFGA;
            reg32_t CFGB;
            reg32_t CFGC;
            reg32_t CFGD;
            reg32_t CFGE;
            reg32_t CFGF;
        };
        reg32_t CFG[6];
    };
    REG32_RSVD(2)
        
    reg32_t PADKEY;
    REG32_RSVD(7)
        
    reg32_t RDA;
    reg32_t RDB;
    reg32_t WTA;
    reg32_t WTB;
    reg32_t WTSA;
    reg32_t WTSB;
    reg32_t WTCA;
    reg32_t WTCB;
    reg32_t ENA;
    reg32_t ENB;
    reg32_t ENSA;
    reg32_t ENSB;
    REG32_RSVD(1)
    reg32_t ENCA;
    reg32_t ENCB;
    
    reg32_t STMRCAP;
    reg32_t IOM0IRQ;
    reg32_t IOM1IRQ;
    reg32_t IOM2IRQ;
    reg32_t IOM3IRQ;
    reg32_t IOM4IRQ;
    reg32_t IOM5IRQ;
    reg32_t LOOPBACK;
    reg32_t GPIOOBS;
    union {
        struct {
            reg32_t ALTPADCFGA;
            reg32_t ALTPADCFGB;
            reg32_t ALTPADCFGC;
            reg32_t ALTPADCFGD;
            
            reg32_t ALTPADCFGE;
            reg32_t ALTPADCFGF;
            reg32_t ALTPADCFGG;
            reg32_t ALTPADCFGH;
            
            reg32_t ALTPADCFGI;
            reg32_t ALTPADCFGJ;
            reg32_t ALTPADCFGK;
            reg32_t ALTPADCFGL;
            
            reg32_t ALTPADCFGM;
        };
        reg32_t ALTPADCFG[13];
    };
    REG32_RSVD(59)

    reg32_t INT0EN;
    reg32_t INT0STAT;
    reg32_t INT0CLR;
    reg32_t INT0SET;
    reg32_t INT1EN;
    reg32_t INT1STAT;
    reg32_t INT1CLR;
    reg32_t INT1SET;
} gpio_reg_t;


/*============================ GLOBAL VARIABLES ==============================*/
/*============================ LOCAL VARIABLES ===============================*/
/*============================ PROTOTYPES ====================================*/


#endif
/* EOF */